[
  {
    "productName": "Canon EOS R6",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Canon EOS R6 is a high-performance full-frame mirrorless camera designed for both photographers and videographers. It delivers excellent low-light performance, fast autofocus, and reliable image stabilization. The camera is well suited for sports, wildlife, and event photography where speed and accuracy are critical. Its robust build and advanced video capabilities make it a versatile professional tool.",
    "price": 2499,
    "sellingPrice": 1899,
    "width": 13.8,
    "height": 9.7,
    "length": 8.8,
    "weight": 560
  },
  {
    "productName": "Canon EOS R5",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Canon EOS R5 is a flagship mirrorless camera offering exceptional resolution and cutting-edge performance. It features a high-resolution sensor capable of capturing stunning detail in both photos and video. This model is ideal for professionals who demand top-tier image quality and advanced autofocus technology. Its solid construction ensures reliability in demanding shooting environments.",
    "price": 3899,
    "sellingPrice": 3499,
    "width": 13.8,
    "height": 9.7,
    "length": 8.8,
    "weight": 650
  },
  {
    "productName": "Nikon Z6 II",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Nikon Z6 II is a powerful mirrorless camera built for speed and versatility. It features improved processing performance, fast autofocus, and strong video capabilities. This camera is well suited for event photography, portraits, and filmmaking. Its ergonomic design ensures comfortable handling during long shoots.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 13.4,
    "height": 10,
    "length": 6.9,
    "weight": 705
  },
  {
    "productName": "Nikon Z7 II",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Nikon Z7 II is a high-resolution mirrorless camera aimed at professionals who prioritize detail and dynamic range. It excels in landscape, studio, and commercial photography. The camera offers precise autofocus and excellent color reproduction. Its robust body makes it suitable for demanding professional use.",
    "price": 2999,
    "sellingPrice": 2699,
    "width": 13.4,
    "height": 10,
    "length": 6.9,
    "weight": 705
  },
  {
    "productName": "Fujifilm X-T5",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Fujifilm X-T5 is a compact mirrorless camera that delivers excellent image quality with a distinctive color science. It is designed for photographers who appreciate manual controls and classic ergonomics. The camera performs well in both still photography and video recording. Its lightweight design makes it ideal for travel and street photography.",
    "price": 1899,
    "sellingPrice": 1699,
    "width": 13,
    "height": 9.1,
    "length": 6.4,
    "weight": 557
  },
  {
    "productName": "Panasonic Lumix GH6",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Panasonic Lumix GH6 is a professional-grade mirrorless camera designed primarily for video creators. It offers advanced video recording formats, excellent thermal management, and reliable stabilization. This model is ideal for filmmakers who need high-quality footage in a compact system. Its rugged build ensures durability during intensive production work.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 13.9,
    "height": 10,
    "length": 9.9,
    "weight": 823
  },
  {
    "productName": "Canon EOS 90D",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Canon EOS 90D is a DSLR camera offering a balance of performance and versatility. It features fast continuous shooting and reliable autofocus for action photography. This camera is suitable for hobbyists and advanced users who prefer an optical viewfinder. Its solid construction makes it dependable for everyday use.",
    "price": 1199,
    "sellingPrice": 999,
    "width": 14.1,
    "height": 10.5,
    "length": 7.7,
    "weight": 701
  },
  {
    "productName": "Sony Alpha A6400",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Sony Alpha A6400 is a compact APS-C mirrorless camera known for its fast autofocus and portability. It is an excellent choice for vloggers, travelers, and content creators. The camera delivers sharp images and reliable video performance. Its lightweight design makes it easy to carry for extended periods.",
    "price": 999,
    "sellingPrice": 849,
    "width": 12,
    "height": 6.7,
    "length": 6,
    "weight": 403
  },
  {
    "productName": "Canon EOS RP",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Canon EOS RP is a lightweight full-frame mirrorless camera designed for enthusiasts entering the full-frame ecosystem. It offers solid image quality, intuitive controls, and reliable autofocus performance. This camera is well suited for travel, portraits, and everyday photography. Its compact size makes it easy to carry for long shooting sessions.",
    "price": 1299,
    "sellingPrice": 1099,
    "width": 13.3,
    "height": 8.5,
    "length": 7,
    "weight": 485
  },
  {
    "productName": "Sony Alpha A6600",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Sony Alpha A6600 is an advanced APS-C mirrorless camera offering excellent autofocus and image stabilization. It is popular among wildlife and sports photographers who need speed in a compact body. The camera also performs well for video recording and vlogging. Its long battery life is a major advantage for extended shoots.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 12,
    "height": 6.9,
    "length": 6.6,
    "weight": 503
  },
  {
    "productName": "Nikon Z50",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Nikon Z50 is a compact mirrorless camera designed for photographers who want portability without sacrificing quality. It features fast autofocus and excellent image processing. This camera is ideal for travel, street photography, and content creation. Its ergonomic grip ensures comfortable handling despite its small size.",
    "price": 999,
    "sellingPrice": 879,
    "width": 12.7,
    "height": 9.4,
    "length": 6,
    "weight": 450
  },
  {
    "productName": "Fujifilm X-S20",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Fujifilm X-S20 is a modern mirrorless camera built for both photographers and video creators. It delivers excellent color reproduction and reliable autofocus performance. This model supports advanced video features while remaining compact. Its versatile design makes it suitable for a wide range of creative workflows.",
    "price": 1399,
    "sellingPrice": 1249,
    "width": 12.7,
    "height": 8.5,
    "length": 6.5,
    "weight": 491
  },
  {
    "productName": "Leica Q2",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Leica Q2 is a premium compact camera offering exceptional image quality and craftsmanship. It features a fixed lens with outstanding sharpness and full-frame performance. This camera is aimed at photographers who value simplicity and precision. Its robust construction reflects Leica’s high manufacturing standards.",
    "price": 4999,
    "sellingPrice": 4699,
    "width": 13,
    "height": 8,
    "length": 9.2,
    "weight": 734
  },
  {
    "productName": "Canon PowerShot G7 X Mark III",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Canon PowerShot G7 X Mark III is a compact camera designed for vloggers and content creators. It offers good image quality in a small and portable body. This camera is ideal for casual photography and video recording. Its simple controls make it easy to use for beginners.",
    "price": 749,
    "sellingPrice": 649,
    "width": 10.5,
    "height": 6.1,
    "length": 4.1,
    "weight": 304
  },
  {
    "productName": "Sony RX100 VII",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Sony RX100 VII is a high-end compact camera delivering impressive performance in a pocket-sized design. It features fast autofocus, excellent image quality, and strong video capabilities. This model is popular among travelers and professionals needing a secondary camera. Its premium build reflects its advanced technology.",
    "price": 1299,
    "sellingPrice": 1199,
    "width": 10.2,
    "height": 5.8,
    "length": 4.3,
    "weight": 302
  },
  {
    "productName": "GoPro HERO12 Black",
    "brandName": "GoPro",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The GoPro HERO12 Black is an action camera built for extreme conditions and adventure filming. It offers excellent stabilization and high-quality video recording. This camera is ideal for sports, travel, and outdoor activities. Its rugged and waterproof design allows use in harsh environments.",
    "price": 499,
    "sellingPrice": 449,
    "width": 7.1,
    "height": 5,
    "length": 3.4,
    "weight": 154
  },
  {
    "productName": "Canon EOS M50 Mark II",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Canon EOS M50 Mark II is a compact mirrorless camera designed for beginners and content creators. It offers reliable autofocus and solid image quality in a lightweight body. This model is well suited for vlogging, travel, and everyday photography. Its intuitive controls make it easy to use for new photographers.",
    "price": 699,
    "sellingPrice": 599,
    "width": 11.6,
    "height": 8.8,
    "length": 5.9,
    "weight": 387
  },
  {
    "productName": "Sony Alpha A6100",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Sony Alpha A6100 is an entry-level mirrorless camera offering fast autofocus and sharp image quality. It performs well for photography and basic video recording. This camera is a good choice for hobbyists and travelers. Its compact size makes it convenient for daily use.",
    "price": 749,
    "sellingPrice": 649,
    "width": 12,
    "height": 6.7,
    "length": 5.9,
    "weight": 396
  },
  {
    "productName": "Nikon D7500",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Nikon D7500 is a DSLR camera designed for enthusiasts who want speed and reliability. It delivers excellent image quality and strong performance in low-light conditions. This model is suitable for sports, wildlife, and action photography. Its durable construction ensures long-term use.",
    "price": 1099,
    "sellingPrice": 949,
    "width": 13.6,
    "height": 10.4,
    "length": 7.2,
    "weight": 720
  },
  {
    "productName": "Fujifilm X-E4",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Fujifilm X-E4 is a slim and stylish mirrorless camera focused on portability. It offers excellent color reproduction and sharp image quality. This camera is ideal for street and travel photography. Its minimalist design appeals to photographers who prefer simplicity.",
    "price": 899,
    "sellingPrice": 799,
    "width": 12.1,
    "height": 7.3,
    "length": 3.3,
    "weight": 364
  },
  {
    "productName": "Panasonic Lumix GX9",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Panasonic Lumix GX9 is a compact mirrorless camera with strong stabilization and image quality. It is well suited for travel and everyday photography. This model supports 4K video recording for casual videography. Its lightweight design makes it easy to carry.",
    "price": 899,
    "sellingPrice": 779,
    "width": 12.4,
    "height": 7.2,
    "length": 4.6,
    "weight": 450
  },
  {
    "productName": "Olympus OM-D E-M10 Mark IV",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Olympus OM-D E-M10 Mark IV is a compact mirrorless camera designed for portability and ease of use. It offers effective image stabilization and good autofocus performance. This camera is ideal for beginners and travelers. Its lightweight body makes it comfortable for long shooting sessions.",
    "price": 799,
    "sellingPrice": 699,
    "width": 12.2,
    "height": 8.4,
    "length": 5,
    "weight": 383
  },
  {
    "productName": "Leica SL2",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Leica SL2 is a professional full-frame mirrorless camera built with exceptional craftsmanship. It delivers outstanding image quality and precise color rendering. This camera is aimed at professionals who value durability and performance. Its solid metal body ensures reliability in demanding environments.",
    "price": 5999,
    "sellingPrice": 5699,
    "width": 14.6,
    "height": 10.7,
    "length": 8.3,
    "weight": 835
  },
  {
    "productName": "Pentax K-70",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Pentax K-70 is a weather-sealed DSLR designed for outdoor photography. It performs well in harsh conditions and offers good image quality. This camera is suitable for landscape and travel photography. Its rugged design makes it reliable in challenging environments.",
    "price": 699,
    "sellingPrice": 599,
    "width": 12.6,
    "height": 9.3,
    "length": 7.4,
    "weight": 688
  },
  {
    "productName": "Ricoh GR III",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Ricoh GR III is a premium compact camera designed for street photography. It offers exceptional sharpness and fast performance in a pocket-sized body. This camera is ideal for photographers who value portability and image quality. Its minimalist controls allow for quick shooting.",
    "price": 999,
    "sellingPrice": 899,
    "width": 10.9,
    "height": 6.2,
    "length": 3.3,
    "weight": 257
  },
  {
    "productName": "DJI Pocket 2",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The DJI Pocket 2 is a compact handheld camera with a built-in gimbal for smooth video recording. It is designed for vloggers and travelers who need stabilization on the go. This camera delivers clear video and decent photo quality. Its small size makes it extremely portable.",
    "price": 349,
    "sellingPrice": 299,
    "width": 3.8,
    "height": 12.4,
    "length": 3,
    "weight": 117
  },
  {
    "productName": "Canon EOS 6D Mark II",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Canon EOS 6D Mark II is a full-frame DSLR aimed at enthusiasts and professionals. It delivers reliable performance and good image quality for portraits and landscapes. This camera features a comfortable grip and intuitive controls. Its durable design supports extended use.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 14.4,
    "height": 11.1,
    "length": 7.5,
    "weight": 765
  },
  {
    "productName": "Nikon D5600",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Nikon D5600 is a lightweight DSLR designed for beginners and hobbyists. It delivers good image quality and easy-to-use controls. This camera is suitable for everyday photography and learning manual settings. Its compact body makes it easy to carry.",
    "price": 699,
    "sellingPrice": 599,
    "width": 12.4,
    "height": 9.7,
    "length": 7,
    "weight": 465
  },
  {
    "productName": "Fujifilm GFX 50S II",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Fujifilm GFX 50S II is a medium format mirrorless camera designed for maximum image quality. It excels in studio, landscape, and commercial photography. This camera offers exceptional dynamic range and detail. Its solid build ensures professional reliability.",
    "price": 3999,
    "sellingPrice": 3699,
    "width": 15,
    "height": 10.4,
    "length": 8.7,
    "weight": 900
  },
  {
    "productName": "Panasonic Lumix TZ200",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Panasonic Lumix TZ200 is a compact travel camera with a powerful zoom lens. It delivers good image quality in a small and portable form. This camera is ideal for travelers who want versatility without carrying heavy gear. Its simple interface makes it easy to use.",
    "price": 799,
    "sellingPrice": 699,
    "width": 11.1,
    "height": 6.6,
    "length": 4.5,
    "weight": 340
  },
  {
    "productName": "GoPro MAX",
    "brandName": "GoPro",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The GoPro MAX is a 360-degree action camera designed for immersive video capture. It offers strong stabilization and rugged build quality. This camera is ideal for adventure sports and creative filming. Its waterproof design allows use in challenging conditions.",
    "price": 499,
    "sellingPrice": 459,
    "width": 6.4,
    "height": 6.9,
    "length": 2.5,
    "weight": 163
  },
  {
    "productName": "Sony ZV-E10",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Sony ZV-E10 is a mirrorless camera designed specifically for vloggers and online creators. It offers excellent autofocus and strong video features. This camera is easy to use and highly portable. Its interchangeable lens system provides creative flexibility.",
    "price": 799,
    "sellingPrice": 699,
    "width": 11.5,
    "height": 6.4,
    "length": 4.5,
    "weight": 343
  },
  {
    "productName": "Nikon Z fc",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Nikon Z fc is a retro-styled mirrorless camera combining classic design with modern technology. It offers good image quality and reliable autofocus. This camera appeals to photographers who value aesthetics and performance. Its compact form makes it suitable for travel and street photography.",
    "price": 959,
    "sellingPrice": 849,
    "width": 13.5,
    "height": 9.4,
    "length": 4.3,
    "weight": 445
  },
  {
    "productName": "Canon EOS R8",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Canon EOS R8 is a lightweight full-frame mirrorless camera focused on speed and portability. It delivers fast autofocus and strong low-light performance. This model is ideal for travel and everyday photography. Its compact body makes it easy to carry for long periods.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 13.2,
    "height": 8.6,
    "length": 7,
    "weight": 461
  },
  {
    "productName": "Nikon Z30",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Nikon Z30 is a compact mirrorless camera designed for vloggers and casual creators. It delivers good image quality and reliable autofocus. This model is easy to use and lightweight. Its simple design makes it suitable for beginners.",
    "price": 699,
    "sellingPrice": 599,
    "width": 12.8,
    "height": 7.3,
    "length": 5.9,
    "weight": 350
  },
  {
    "productName": "Fujifilm X-H2",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Fujifilm X-H2 is a high-resolution APS-C mirrorless camera aimed at advanced users. It excels in detail-rich photography and controlled studio work. This camera also supports advanced video features. Its solid body ensures durability for professional use.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 13.6,
    "height": 9.2,
    "length": 8.4,
    "weight": 660
  },
  {
    "productName": "Panasonic Lumix G9 II",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Panasonic Lumix G9 II is a Micro Four Thirds camera designed for speed and precision. It delivers excellent stabilization and fast autofocus performance. This model is suitable for wildlife and action photography. Its ergonomic design provides comfortable handling.",
    "price": 1699,
    "sellingPrice": 1549,
    "width": 13.4,
    "height": 10,
    "length": 9,
    "weight": 658
  },
  {
    "productName": "Olympus Tough TG-7",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Olympus Tough TG-7 is a rugged compact camera built for extreme environments. It is waterproof, shockproof, and freezeproof. This camera is ideal for outdoor adventures and travel. Its durable construction ensures reliable performance in harsh conditions.",
    "price": 499,
    "sellingPrice": 449,
    "width": 11.3,
    "height": 6.6,
    "length": 3.2,
    "weight": 249
  },
  {
    "productName": "Leica M11",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Leica M11 is a premium rangefinder camera designed for photographers who value craftsmanship and precision. It delivers exceptional image quality and dynamic range. This camera is ideal for street and documentary photography. Its minimalist design reflects Leica’s heritage.",
    "price": 8299,
    "sellingPrice": 7999,
    "width": 13.9,
    "height": 8,
    "length": 3.9,
    "weight": 530
  },
  {
    "productName": "Pentax K-3 Mark III",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Pentax K-3 Mark III is a high-end DSLR designed for enthusiasts who prefer optical viewfinders. It delivers excellent image quality and rugged build quality. This camera performs well in outdoor and low-light conditions. Its weather sealing ensures durability.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 13.5,
    "height": 10.4,
    "length": 7.4,
    "weight": 820
  },
  {
    "productName": "DJI Action 4",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The DJI Action 4 is an action camera designed for high-quality video recording in extreme conditions. It offers excellent stabilization and low-light performance. This camera is suitable for sports and adventure filming. Its rugged design supports underwater use.",
    "price": 429,
    "sellingPrice": 399,
    "width": 7,
    "height": 4.5,
    "length": 3.2,
    "weight": 145
  },
  {
    "productName": "Sony Alpha A1",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Sony Alpha A1 is a flagship mirrorless camera combining speed, resolution, and video performance. It is designed for professionals who demand maximum versatility. This camera excels in sports, wildlife, and studio photography. Its premium build ensures reliability.",
    "price": 6499,
    "sellingPrice": 6199,
    "width": 12.9,
    "height": 9.7,
    "length": 8.1,
    "weight": 737
  },
  {
    "productName": "Nikon D850",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Nikon D850 is a professional DSLR known for its high resolution and dynamic range. It is ideal for landscape, studio, and commercial photography. This camera delivers excellent detail and color accuracy. Its solid construction ensures durability.",
    "price": 2999,
    "sellingPrice": 2799,
    "width": 14.6,
    "height": 12.4,
    "length": 7.9,
    "weight": 1005
  },
  {
    "productName": "Fujifilm X100V",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Fujifilm X100V is a premium compact camera with a fixed lens and classic design. It delivers excellent image quality and beautiful color rendering. This camera is popular for street and travel photography. Its compact form encourages creative shooting.",
    "price": 1399,
    "sellingPrice": 1299,
    "width": 12.8,
    "height": 7.5,
    "length": 5.3,
    "weight": 478
  },
  {
    "productName": "Panasonic Lumix FZ1000 II",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Panasonic Lumix FZ1000 II is a bridge camera with a large sensor and powerful zoom. It delivers good image quality for its class. This camera is suitable for travel and wildlife photography. Its all-in-one design reduces the need for extra lenses.",
    "price": 899,
    "sellingPrice": 799,
    "width": 13.7,
    "height": 9.9,
    "length": 13.1,
    "weight": 810
  },
  {
    "productName": "Hasselblad X2D 100C",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Hasselblad X2D 100C is a medium format mirrorless camera built for ultimate image quality. It delivers exceptional color depth and dynamic range. This camera is aimed at high-end studio and commercial photographers. Its premium build reflects professional standards.",
    "price": 8199,
    "sellingPrice": 7899,
    "width": 14.8,
    "height": 10.6,
    "length": 7.4,
    "weight": 895
  },
  {
    "productName": "Canon PowerShot SX740 HS",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Canon PowerShot SX740 HS is a compact travel camera with a long zoom range. It is designed for convenience and portability. This camera performs well for casual photography and video. Its lightweight body makes it easy to carry anywhere.",
    "price": 399,
    "sellingPrice": 349,
    "width": 11,
    "height": 6.4,
    "length": 4,
    "weight": 299
  },
  {
    "productName": "Sony RX10 IV",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Sony RX10 IV is a premium bridge camera with a fast zoom lens and advanced autofocus. It offers excellent image quality in an all-in-one design. This camera is suitable for travel and event photography. Its robust build supports professional use.",
    "price": 1699,
    "sellingPrice": 1599,
    "width": 13.3,
    "height": 9.4,
    "length": 12.7,
    "weight": 1095
  },
  {
    "productName": "Insta360 X3",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Insta360 X3 is a 360-degree action camera designed for immersive content creation. It offers strong stabilization and creative shooting modes. This camera is ideal for sports and social media videos. Its compact design makes it easy to mount and carry.",
    "price": 449,
    "sellingPrice": 419,
    "width": 4.6,
    "height": 11.4,
    "length": 3.3,
    "weight": 180
  },
  {
    "productName": "Canon EOS R7",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Canon EOS R7 is an APS-C mirrorless camera built for speed and action photography. It offers fast continuous shooting and advanced autofocus tracking. This camera is ideal for wildlife and sports photographers. Its compact body makes it easy to carry into the field.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 13.2,
    "height": 9,
    "length": 9.1,
    "weight": 612
  },
  {
    "productName": "Sony Alpha A7C",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Sony Alpha A7C is a compact full-frame mirrorless camera designed for portability. It delivers excellent image quality in a small rangefinder-style body. This model is suitable for travel and street photography. Its autofocus system ensures reliable subject tracking.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 12.4,
    "height": 7.1,
    "length": 6,
    "weight": 509
  },
  {
    "productName": "Fujifilm X-Pro3",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Fujifilm X-Pro3 is a premium mirrorless camera designed for documentary and street photographers. It features a unique hidden LCD and hybrid viewfinder. This camera emphasizes shooting experience and image quality. Its durable titanium body ensures longevity.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 14.1,
    "height": 8.3,
    "length": 4.6,
    "weight": 497
  },
  {
    "productName": "Panasonic Lumix S1",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Panasonic Lumix S1 is a full-frame mirrorless camera designed for professionals. It offers excellent image quality and strong video capabilities. This camera is suitable for studio, landscape, and video production. Its robust body provides reliable performance.",
    "price": 2499,
    "sellingPrice": 2199,
    "width": 14.9,
    "height": 11,
    "length": 9.6,
    "weight": 1021
  },
  {
    "productName": "Olympus OM-5",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Olympus OM-5 is a compact mirrorless camera designed for outdoor photography. It offers effective stabilization and weather sealing. This camera is ideal for hiking and travel photography. Its lightweight body enhances portability.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 12.5,
    "height": 8.5,
    "length": 4.9,
    "weight": 414
  },
  {
    "productName": "Leica CL",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Leica CL is a compact APS-C mirrorless camera combining premium build quality with simplicity. It delivers excellent image quality and color accuracy. This camera is suitable for everyday and street photography. Its minimalist design reflects Leica’s philosophy.",
    "price": 2799,
    "sellingPrice": 2599,
    "width": 13.1,
    "height": 7.8,
    "length": 4.5,
    "weight": 403
  },
  {
    "productName": "Pentax KF",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Pentax KF is a rugged DSLR designed for outdoor use. It offers weather sealing and reliable image quality. This camera is suitable for landscape and adventure photography. Its durable body ensures dependable performance.",
    "price": 849,
    "sellingPrice": 749,
    "width": 12.6,
    "height": 9.3,
    "length": 7.4,
    "weight": 684
  },
  {
    "productName": "DJI Mini 4 Pro Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The DJI Mini 4 Pro Camera is designed for aerial imaging in a compact form factor. It delivers sharp photos and stabilized video. This camera is ideal for travel and outdoor filming. Its lightweight design supports extended flight time.",
    "price": 759,
    "sellingPrice": 699,
    "width": 6.8,
    "height": 5.5,
    "length": 4.2,
    "weight": 249
  },
  {
    "productName": "Canon EOS 5D Mark IV",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Canon EOS 5D Mark IV is a professional DSLR known for reliability and image quality. It performs well in studio and outdoor environments. This camera is widely used by professionals. Its rugged design ensures long-term durability.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 15.1,
    "height": 11.6,
    "length": 7.6,
    "weight": 890
  },
  {
    "productName": "Sony ZV-1 II",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Sony ZV-1 II is a compact camera designed for vloggers and content creators. It offers strong autofocus and good low-light performance. This camera is easy to use and highly portable. Its design supports handheld shooting.",
    "price": 899,
    "sellingPrice": 799,
    "width": 10.5,
    "height": 6,
    "length": 4.5,
    "weight": 292
  },
  {
    "productName": "Nikon Coolpix P1000",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Nikon Coolpix P1000 is a superzoom bridge camera with extreme focal length capabilities. It is ideal for wildlife and astronomy photography. This camera offers versatility without changing lenses. Its large body supports advanced optics.",
    "price": 999,
    "sellingPrice": 899,
    "width": 14.6,
    "height": 11.9,
    "length": 18.1,
    "weight": 1415
  },
  {
    "productName": "Fujifilm X-H1",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Fujifilm X-H1 is a mirrorless camera featuring in-body stabilization and strong build quality. It delivers excellent image quality and video performance. This camera is suitable for hybrid shooting. Its ergonomic grip improves handling.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 13.9,
    "height": 9.8,
    "length": 8.6,
    "weight": 673
  },
  {
    "productName": "Panasonic Lumix G100",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Panasonic Lumix G100 is a compact mirrorless camera aimed at vloggers. It offers good video quality and portability. This camera is easy to operate for beginners. Its lightweight design supports everyday use.",
    "price": 749,
    "sellingPrice": 649,
    "width": 11.5,
    "height": 8.3,
    "length": 5.4,
    "weight": 412
  },
  {
    "productName": "Hasselblad X1D II 50C",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Hasselblad X1D II 50C is a medium format mirrorless camera built for exceptional image quality. It delivers stunning color depth and detail. This camera is designed for professional studio and landscape work. Its premium construction reflects high-end craftsmanship.",
    "price": 5799,
    "sellingPrice": 5499,
    "width": 15,
    "height": 10.2,
    "length": 7.1,
    "weight": 725
  },
  {
    "productName": "Canon IXUS 285 HS",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Canon IXUS 285 HS is a compact point-and-shoot camera for casual photography. It offers simple operation and decent image quality. This camera is ideal for everyday snapshots. Its slim design fits easily into a pocket.",
    "price": 249,
    "sellingPrice": 219,
    "width": 9.9,
    "height": 5.8,
    "length": 2.2,
    "weight": 147
  },
  {
    "productName": "Sony A6700",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Sony A6700 is an advanced APS-C mirrorless camera offering fast performance and strong video features. It is designed for photographers and videographers alike. This camera performs well in action and low-light scenarios. Its compact size enhances mobility.",
    "price": 1699,
    "sellingPrice": 1549,
    "width": 12.7,
    "height": 7.8,
    "length": 6.3,
    "weight": 493
  },
  {
    "productName": "Insta360 ONE RS",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Insta360 ONE RS is a modular action camera designed for versatility. It supports multiple shooting modes and creative effects. This camera is ideal for sports and social media content. Its modular design allows easy customization.",
    "price": 549,
    "sellingPrice": 499,
    "width": 7,
    "height": 4.9,
    "length": 3.2,
    "weight": 125
  },
  {
    "productName": "Fujifilm X-S10",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Fujifilm X-S10 is a compact mirrorless camera featuring in-body image stabilization. It delivers strong image quality and flexible shooting options. This camera is suitable for both beginners and advanced users. Its ergonomic grip improves handling.",
    "price": 999,
    "sellingPrice": 899,
    "width": 12.6,
    "height": 8.5,
    "length": 6.5,
    "weight": 465
  },
  {
    "productName": "Olympus PEN E-P7",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Olympus PEN E-P7 is a stylish mirrorless camera designed for everyday photography. It offers good image quality in a compact body. This camera is ideal for casual users and travelers. Its simple controls make it easy to use.",
    "price": 799,
    "sellingPrice": 719,
    "width": 11.8,
    "height": 6.9,
    "length": 3.8,
    "weight": 337
  },
  {
    "productName": "Ricoh WG-80",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Ricoh WG-80 is a rugged compact camera built for tough conditions. It is waterproof, shockproof, and freeze-resistant. This camera is ideal for outdoor activities and travel. Its durable construction ensures dependable use.",
    "price": 299,
    "sellingPrice": 269,
    "width": 11.6,
    "height": 6.6,
    "length": 3.1,
    "weight": 242
  },
  {
    "productName": "Nikon D780",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Nikon D780 is a versatile DSLR combining traditional handling with modern features. It delivers excellent low-light performance and image quality. This camera is suitable for professionals and enthusiasts alike. Its solid build ensures reliability.",
    "price": 2299,
    "sellingPrice": 2099,
    "width": 14.4,
    "height": 11.6,
    "length": 7.6,
    "weight": 840
  },
  {
    "productName": "Hasselblad 907X 50C",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Hasselblad 907X 50C is a modular medium format camera designed for ultimate image quality. It delivers stunning detail and color depth. This camera is ideal for fine art and commercial photography. Its unique design allows flexible shooting styles.",
    "price": 6399,
    "sellingPrice": 6099,
    "width": 10.2,
    "height": 9.2,
    "length": 6,
    "weight": 740
  },
  {
    "productName": "Insta360 GO 3",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Insta360 GO 3 is an ultra-compact action camera designed for hands-free recording. It delivers stabilized video in a tiny form factor. This camera is ideal for creative and everyday content. Its lightweight design allows easy mounting.",
    "price": 399,
    "sellingPrice": 369,
    "width": 2.5,
    "height": 5.4,
    "length": 2.3,
    "weight": 35
  },
  {
    "productName": "Panasonic Lumix S5",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Panasonic Lumix S5 is a full-frame mirrorless camera designed for hybrid shooters. It offers strong video features and excellent stabilization. This camera is suitable for photography and filmmaking. Its compact body improves portability.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 13.2,
    "height": 9.7,
    "length": 8.1,
    "weight": 714
  },
  {
    "productName": "Olympus OM-D E-M1 Mark II",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Olympus OM-D E-M1 Mark II is a professional Micro Four Thirds camera built for speed. It offers fast burst shooting and excellent stabilization. This camera is ideal for wildlife and sports photography. Its weather-sealed body ensures durability.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 13.4,
    "height": 9.1,
    "length": 6.9,
    "weight": 574
  },
  {
    "productName": "Leica D-Lux 7",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Leica D-Lux 7 is a premium compact camera offering excellent build quality. It delivers sharp images and natural colors. This camera is suitable for everyday and travel photography. Its compact size allows easy portability.",
    "price": 1299,
    "sellingPrice": 1199,
    "width": 11.8,
    "height": 6.6,
    "length": 6.4,
    "weight": 403
  },
  {
    "productName": "Pentax K-1 Mark II",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Pentax K-1 Mark II is a full-frame DSLR designed for enthusiasts and professionals. It offers excellent dynamic range and weather sealing. This camera is ideal for landscape photography. Its solid build ensures reliable operation.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 15.6,
    "height": 11.4,
    "length": 8.6,
    "weight": 1010
  },
  {
    "productName": "DJI Osmo Action 3",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The DJI Osmo Action 3 is an action camera built for extreme environments. It offers excellent stabilization and durability. This camera is ideal for sports and adventure filming. Its rugged design supports underwater recording.",
    "price": 399,
    "sellingPrice": 369,
    "width": 7,
    "height": 4.4,
    "length": 3.2,
    "weight": 145
  },
  {
    "productName": "Panasonic Lumix GH5 II",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Panasonic Lumix GH5 II is a mirrorless camera designed for video professionals. It offers strong video codecs and stabilization. This camera is ideal for filmmaking and content creation. Its durable body supports intensive use.",
    "price": 1699,
    "sellingPrice": 1549,
    "width": 13.9,
    "height": 9.8,
    "length": 8.7,
    "weight": 727
  },
  {
    "productName": "Hasselblad H6D-50c",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Hasselblad H6D-50c is a professional medium format camera for studio photography. It delivers exceptional resolution and color accuracy. This camera is built for commercial and fashion photography. Its premium construction ensures reliability.",
    "price": 28999,
    "sellingPrice": 26999,
    "width": 15.6,
    "height": 12.3,
    "length": 16.1,
    "weight": 2300
  },
  {
    "productName": "Sony FX3",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Sony FX3 is a compact cinema camera designed for professional filmmakers. It delivers exceptional video quality and low-light performance. This camera is ideal for handheld and rigged shooting. Its lightweight body improves flexibility.",
    "price": 3899,
    "sellingPrice": 3599,
    "width": 12.9,
    "height": 8.4,
    "length": 7.8,
    "weight": 715
  },
  {
    "productName": "Insta360 Ace Pro",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Insta360 Ace Pro is a high-performance action camera designed for extreme sports. It delivers stabilized footage and high-resolution video. This camera is ideal for adventure creators. Its rugged build ensures durability in harsh conditions.",
    "price": 449,
    "sellingPrice": 419,
    "width": 7.1,
    "height": 4.6,
    "length": 3.3,
    "weight": 178
  },
  {
    "productName": "Canon EOS R5 C",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Canon EOS R5 C blends high-resolution photography with advanced cinema video features. It is designed for hybrid creators who need flexibility on set. The camera delivers excellent detail and color accuracy. Its robust cooling system supports long recording sessions.",
    "price": 3999,
    "sellingPrice": 3699,
    "width": 13.8,
    "height": 9.8,
    "length": 8.8,
    "weight": 680
  },
  {
    "productName": "Sony Alpha A7R V",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Sony Alpha A7R V is a high-resolution mirrorless camera aimed at professionals. It delivers exceptional detail and advanced subject recognition autofocus. This camera excels in landscape and studio photography. Its refined ergonomics improve long shooting sessions.",
    "price": 3899,
    "sellingPrice": 3599,
    "width": 12.9,
    "height": 9.7,
    "length": 8.2,
    "weight": 723
  },
  {
    "productName": "Pentax KP",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Pentax KP is a compact DSLR designed for photography enthusiasts. It offers strong low-light performance and weather sealing. This camera is suitable for outdoor and travel photography. Its interchangeable grips improve handling flexibility.",
    "price": 999,
    "sellingPrice": 899,
    "width": 13.2,
    "height": 10.1,
    "length": 7.6,
    "weight": 703
  },
  {
    "productName": "Ricoh Theta Z1",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Ricoh Theta Z1 is a premium 360-degree camera for immersive photography. It delivers high-quality stills and video. This camera is suitable for professional virtual tours. Its compact design allows easy deployment.",
    "price": 999,
    "sellingPrice": 899,
    "width": 6.7,
    "height": 13.3,
    "length": 3.9,
    "weight": 182
  },
  {
    "productName": "DJI Air 3 Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI Air 3 Camera is designed for aerial photography and video capture. It offers sharp imagery and stabilized footage. This camera is ideal for travel and landscape shots. Its lightweight design supports extended flight times.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 7.2,
    "height": 6,
    "length": 5,
    "weight": 300
  },
  {
    "productName": "Canon EOS Rebel SL3",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Canon EOS Rebel SL3 is a compact DSLR aimed at beginners. It offers simple controls and good image quality. This camera is suitable for learning photography fundamentals. Its lightweight body improves comfort during use.",
    "price": 649,
    "sellingPrice": 579,
    "width": 12.2,
    "height": 9.3,
    "length": 6.9,
    "weight": 449
  },
  {
    "productName": "Fujifilm GFX100 II",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Fujifilm GFX100 II is a flagship medium format mirrorless camera. It delivers extreme resolution and outstanding dynamic range. This camera is designed for high-end commercial work. Its advanced autofocus improves usability.",
    "price": 7499,
    "sellingPrice": 7199,
    "width": 15.2,
    "height": 10.6,
    "length": 8.7,
    "weight": 1030
  },
  {
    "productName": "Panasonic Lumix LX100 II",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Panasonic Lumix LX100 II is a premium compact camera with a large sensor. It delivers excellent image quality and manual controls. This camera is ideal for street and travel photography. Its compact body ensures portability.",
    "price": 999,
    "sellingPrice": 899,
    "width": 11.5,
    "height": 6.6,
    "length": 6.4,
    "weight": 392
  },
  {
    "productName": "Hasselblad H6D-100c",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 5,
    "description": "The Hasselblad H6D-100c is a high-resolution medium format camera for elite professionals. It delivers unparalleled detail and color accuracy. This camera is built for studio and commercial photography. Its premium construction ensures reliability.",
    "price": 32999,
    "sellingPrice": 30999,
    "width": 15.6,
    "height": 12.3,
    "length": 16.1,
    "weight": 2350
  },
  {
    "productName": "Canon PowerShot G5 X Mark II",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Canon PowerShot G5 X Mark II is a compact camera with a fast zoom lens. It delivers good image quality in a small package. This camera is ideal for travel photography. Its pop-up viewfinder adds flexibility.",
    "price": 899,
    "sellingPrice": 799,
    "width": 11.1,
    "height": 6.1,
    "length": 4.6,
    "weight": 340
  },
  {
    "productName": "Insta360 ONE X2",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Insta360 ONE X2 is a 360-degree action camera designed for immersive video capture. It delivers smooth stabilized footage. This camera is ideal for sports and creative content. Its slim design improves portability.",
    "price": 429,
    "sellingPrice": 399,
    "width": 4.6,
    "height": 11.3,
    "length": 3,
    "weight": 149
  },
  {
    "productName": "Canon EOS R3",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Canon EOS R3 is a flagship mirrorless camera designed for professional sports and wildlife photographers. It offers ultra-fast autofocus with advanced subject tracking. This camera performs exceptionally well in low-light environments. Its rugged body is built for demanding professional use.",
    "price": 5999,
    "sellingPrice": 5699,
    "width": 15,
    "height": 14.3,
    "length": 8.8,
    "weight": 1015
  },
  {
    "productName": "Sony Alpha A7S III",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Sony Alpha A7S III is a professional mirrorless camera focused on video performance. It delivers exceptional low-light sensitivity and cinematic image quality. This camera is widely used by filmmakers. Its advanced cooling allows long recording sessions.",
    "price": 3899,
    "sellingPrice": 3599,
    "width": 12.9,
    "height": 9.7,
    "length": 8.1,
    "weight": 699
  },
  {
    "productName": "Nikon Z9",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Nikon Z9 is a professional mirrorless camera built for speed and reliability. It features a stacked sensor and blackout-free shooting. This camera is ideal for sports and wildlife photography. Its integrated grip supports extended shooting sessions.",
    "price": 5499,
    "sellingPrice": 5199,
    "width": 14.9,
    "height": 14.9,
    "length": 8.6,
    "weight": 1160
  },
  {
    "productName": "Olympus OM-D E-M1X",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Olympus OM-D E-M1X is a professional Micro Four Thirds camera with an integrated grip. It delivers fast autofocus and excellent stabilization. This camera is ideal for wildlife photography. Its weather-sealed body is built for harsh environments.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 14.4,
    "height": 14.7,
    "length": 7.5,
    "weight": 997
  },
  {
    "productName": "Leica M10-R",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Leica M10-R is a high-resolution rangefinder camera for photography purists. It delivers exceptional image quality and detail. This camera is ideal for street and documentary work. Its minimalist design emphasizes manual shooting.",
    "price": 8299,
    "sellingPrice": 7999,
    "width": 13.9,
    "height": 8,
    "length": 3.9,
    "weight": 660
  },
  {
    "productName": "Pentax 645Z",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Pentax 645Z is a medium format DSLR delivering outstanding image quality. It is designed for studio and landscape photography. This camera offers excellent dynamic range and color depth. Its robust construction ensures durability.",
    "price": 4999,
    "sellingPrice": 4699,
    "width": 15.6,
    "height": 11.7,
    "length": 12.3,
    "weight": 1550
  },
  {
    "productName": "Ricoh WG-6",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Ricoh WG-6 is a rugged compact camera designed for outdoor use. It is waterproof, shockproof, and dustproof. This camera is ideal for adventure and travel photography. Its durable build ensures reliability in tough conditions.",
    "price": 399,
    "sellingPrice": 359,
    "width": 11.8,
    "height": 6.5,
    "length": 3.3,
    "weight": 246
  },
  {
    "productName": "DJI Mavic 3 Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Mavic 3 Camera is designed for professional aerial photography. It delivers sharp images with excellent dynamic range. This camera is ideal for landscape and commercial drone work. Its advanced stabilization ensures smooth footage.",
    "price": 2299,
    "sellingPrice": 2099,
    "width": 8.4,
    "height": 6.1,
    "length": 5.2,
    "weight": 335
  },
  {
    "productName": "Canon EOS 7D Mark II",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Canon EOS 7D Mark II is a DSLR designed for sports and wildlife photography. It offers fast continuous shooting and durable construction. This camera performs well in demanding conditions. Its ergonomic grip enhances handling.",
    "price": 1499,
    "sellingPrice": 1299,
    "width": 14.9,
    "height": 11.2,
    "length": 7.8,
    "weight": 910
  },
  {
    "productName": "Sony Alpha A58",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Sony Alpha A58 is an entry-level DSLR-style camera for beginners. It offers decent image quality and simple controls. This camera is suitable for learning photography fundamentals. Its lightweight design supports easy use.",
    "price": 549,
    "sellingPrice": 489,
    "width": 12.8,
    "height": 9.5,
    "length": 7.8,
    "weight": 573
  },
  {
    "productName": "Nikon D500",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Nikon D500 is a high-performance APS-C DSLR designed for action photography. It offers fast autofocus and high burst rates. This camera is ideal for wildlife and sports shooting. Its rugged body ensures durability.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 14.7,
    "height": 11.5,
    "length": 8.1,
    "weight": 860
  },
  {
    "productName": "Fujifilm X100F",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Fujifilm X100F is a compact camera with a fixed lens and classic styling. It delivers excellent image quality and color rendering. This camera is popular among street photographers. Its compact form encourages everyday use.",
    "price": 1199,
    "sellingPrice": 1099,
    "width": 12.7,
    "height": 7.4,
    "length": 5.1,
    "weight": 469
  },
  {
    "productName": "Panasonic Lumix G85",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Panasonic Lumix G85 is a mirrorless camera designed for enthusiasts. It offers in-body stabilization and good video capabilities. This camera is suitable for travel and outdoor photography. Its weather-sealed body adds durability.",
    "price": 699,
    "sellingPrice": 629,
    "width": 12.8,
    "height": 8.9,
    "length": 7.4,
    "weight": 505
  },
  {
    "productName": "Hasselblad Lunar",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Hasselblad Lunar is a luxury mirrorless camera with premium materials. It offers solid image quality and stylish design. This camera targets collectors and enthusiasts. Its unique appearance sets it apart from standard models.",
    "price": 3999,
    "sellingPrice": 3499,
    "width": 12.7,
    "height": 9.4,
    "length": 6.5,
    "weight": 650
  },
  {
    "productName": "Canon PowerShot SX70 HS",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Canon PowerShot SX70 HS is a bridge camera with an extensive zoom range. It delivers versatility for travel and wildlife photography. This camera reduces the need for multiple lenses. Its ergonomic body supports comfortable shooting.",
    "price": 549,
    "sellingPrice": 499,
    "width": 12.7,
    "height": 9.1,
    "length": 11.6,
    "weight": 610
  },
  {
    "productName": "Sony RX10 III",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Sony RX10 III is a premium bridge camera with a fast zoom lens. It delivers high image quality across a wide focal range. This camera is ideal for travel and event photography. Its solid build supports professional use.",
    "price": 1599,
    "sellingPrice": 1449,
    "width": 13.3,
    "height": 9.4,
    "length": 12.7,
    "weight": 1051
  },
  {
    "productName": "Insta360 EVO",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Insta360 EVO is a versatile camera capable of both 360-degree and 180-degree 3D capture. It delivers immersive content for creative projects. This camera is ideal for VR enthusiasts. Its folding design allows flexible shooting modes.",
    "price": 429,
    "sellingPrice": 399,
    "width": 6.5,
    "height": 11,
    "length": 3,
    "weight": 365
  },
  {
    "productName": "Canon EOS R1",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Canon EOS R1 is a flagship mirrorless camera designed for elite professional use. It delivers exceptional speed, autofocus precision, and image quality. This camera is ideal for sports, wildlife, and press photography. Its rugged body is built for extreme conditions.",
    "price": 6999,
    "sellingPrice": 6699,
    "width": 15.8,
    "height": 14.9,
    "length": 9,
    "weight": 1100
  },
  {
    "productName": "Sony Alpha A9",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Sony Alpha A9 is a professional mirrorless camera optimized for speed. It offers blackout-free shooting and fast autofocus tracking. This camera is popular among sports photographers. Its compact form improves mobility during long shoots.",
    "price": 3499,
    "sellingPrice": 3199,
    "width": 12.7,
    "height": 9.6,
    "length": 6.3,
    "weight": 673
  },
  {
    "productName": "Nikon Z8",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Nikon Z8 is a high-end mirrorless camera combining speed and resolution. It delivers excellent image quality and advanced autofocus. This camera is suitable for both photography and video production. Its compact professional body enhances handling.",
    "price": 3999,
    "sellingPrice": 3799,
    "width": 14.4,
    "height": 11.8,
    "length": 8.3,
    "weight": 910
  },
  {
    "productName": "Fujifilm X-T4",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Fujifilm X-T4 is a versatile mirrorless camera with in-body stabilization. It delivers excellent image quality and video performance. This camera is ideal for hybrid shooters. Its classic design provides intuitive controls.",
    "price": 1699,
    "sellingPrice": 1549,
    "width": 13.5,
    "height": 9.3,
    "length": 6.4,
    "weight": 607
  },
  {
    "productName": "Panasonic Lumix G95",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Panasonic Lumix G95 is a mirrorless camera designed for enthusiasts. It offers good image stabilization and video features. This camera is suitable for travel and outdoor photography. Its weather-sealed body adds durability.",
    "price": 799,
    "sellingPrice": 729,
    "width": 13,
    "height": 9.3,
    "length": 7.7,
    "weight": 536
  },
  {
    "productName": "Olympus PEN-F",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Olympus PEN-F is a stylish mirrorless camera designed for creative photographers. It delivers excellent color profiles and compact design. This camera is ideal for street and travel photography. Its premium build enhances shooting experience.",
    "price": 1199,
    "sellingPrice": 1099,
    "width": 12.4,
    "height": 7.2,
    "length": 3.7,
    "weight": 427
  },
  {
    "productName": "Pentax K-5 II",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Pentax K-5 II is a rugged DSLR designed for outdoor photography. It offers reliable autofocus and strong image quality. This camera performs well in low-light conditions. Its weather-sealed body ensures durability.",
    "price": 749,
    "sellingPrice": 679,
    "width": 13.1,
    "height": 9.7,
    "length": 7.3,
    "weight": 740
  },
  {
    "productName": "Ricoh CX6",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Ricoh CX6 is a compact digital camera designed for everyday photography. It offers simple controls and good zoom capabilities. This camera is ideal for casual use. Its lightweight design improves portability.",
    "price": 249,
    "sellingPrice": 219,
    "width": 10.1,
    "height": 5.8,
    "length": 2.9,
    "weight": 195
  },
  {
    "productName": "DJI Inspire 3 Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Inspire 3 Camera is designed for high-end aerial cinematography. It delivers professional-grade image quality and stabilization. This camera is used in film and commercial productions. Its advanced design supports complex shooting scenarios.",
    "price": 7999,
    "sellingPrice": 7699,
    "width": 12,
    "height": 8.5,
    "length": 7.5,
    "weight": 420
  },
  {
    "productName": "Canon EOS Rebel T8i",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Canon EOS Rebel T8i is a beginner-friendly DSLR with advanced features. It delivers good image quality and fast autofocus. This camera is ideal for learning photography. Its ergonomic design improves comfort.",
    "price": 749,
    "sellingPrice": 679,
    "width": 13.1,
    "height": 10,
    "length": 7.6,
    "weight": 515
  },
  {
    "productName": "Sony Alpha A3000",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4,
    "description": "The Sony Alpha A3000 is an entry-level mirrorless camera with DSLR-style design. It offers basic image quality and interchangeable lenses. This camera is suitable for beginners. Its simple interface makes it easy to use.",
    "price": 449,
    "sellingPrice": 399,
    "width": 12.8,
    "height": 9,
    "length": 8.5,
    "weight": 411
  },
  {
    "productName": "Nikon D7200",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Nikon D7200 is an enthusiast DSLR offering excellent image quality. It performs well in low-light and fast-action situations. This camera is ideal for wildlife and sports photography. Its robust build supports outdoor use.",
    "price": 899,
    "sellingPrice": 819,
    "width": 13.6,
    "height": 10.7,
    "length": 7.6,
    "weight": 765
  },
  {
    "productName": "Fujifilm X-A7",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Fujifilm X-A7 is a compact mirrorless camera aimed at beginners and vloggers. It offers good image quality and a large touchscreen. This camera is easy to operate. Its lightweight body improves portability.",
    "price": 699,
    "sellingPrice": 629,
    "width": 11.9,
    "height": 6.7,
    "length": 4.1,
    "weight": 320
  },
  {
    "productName": "Panasonic Lumix FZ300",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Panasonic Lumix FZ300 is a bridge camera with a constant-aperture zoom lens. It offers versatility for travel and wildlife photography. This camera is weather-sealed for outdoor use. Its ergonomic grip improves handling.",
    "price": 599,
    "sellingPrice": 549,
    "width": 13.2,
    "height": 9.2,
    "length": 11.7,
    "weight": 691
  },
  {
    "productName": "Canon PowerShot SX620 HS",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Canon PowerShot SX620 HS is a compact camera designed for casual photography. It offers a versatile zoom range and simple operation. This camera is ideal for travel and everyday snapshots. Its lightweight design enhances portability.",
    "price": 279,
    "sellingPrice": 249,
    "width": 9.7,
    "height": 5.7,
    "length": 2.8,
    "weight": 182
  },
  {
    "productName": "Sony RX0 II",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sony RX0 II is an ultra-compact rugged camera designed for action and vlogging. It offers excellent image quality in a small form factor. This camera is waterproof and shockproof. Its durable build supports extreme conditions.",
    "price": 699,
    "sellingPrice": 629,
    "width": 5.9,
    "height": 4,
    "length": 3.5,
    "weight": 132
  },
  {
    "productName": "Insta360 Sphere",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Insta360 Sphere is a 360-degree camera designed for drone-based filming. It delivers immersive aerial footage. This camera is ideal for creative drone content. Its modular design allows easy mounting.",
    "price": 429,
    "sellingPrice": 399,
    "width": 6,
    "height": 11.2,
    "length": 3.1,
    "weight": 190
  },
  {
    "productName": "Canon EOS R50 V",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Canon EOS R50 V is a compact mirrorless camera aimed at video-first creators. It offers reliable autofocus and clean image output. This camera is easy to set up and operate. Its lightweight body suits handheld shooting and travel.",
    "price": 749,
    "sellingPrice": 679,
    "width": 11.9,
    "height": 8.4,
    "length": 6.2,
    "weight": 372
  },
  {
    "productName": "Nikon Zf",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Nikon Zf combines classic design with modern mirrorless technology. It delivers strong image quality and reliable autofocus. This camera is well suited for street and lifestyle photography. Its retro controls enhance the shooting experience.",
    "price": 1999,
    "sellingPrice": 1849,
    "width": 14.4,
    "height": 10.3,
    "length": 7,
    "weight": 710
  },
  {
    "productName": "Fujifilm X-T200",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Fujifilm X-T200 is an entry-level mirrorless camera with a large touchscreen. It offers good image quality and intuitive controls. This camera is ideal for beginners and vloggers. Its compact design improves portability.",
    "price": 699,
    "sellingPrice": 629,
    "width": 12.2,
    "height": 8.4,
    "length": 5.6,
    "weight": 370
  },
  {
    "productName": "Panasonic Lumix S1H",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Panasonic Lumix S1H is a professional full-frame camera designed for cinema production. It delivers exceptional video quality and dynamic range. This camera is certified for professional filmmaking. Its robust body supports long recording sessions.",
    "price": 3999,
    "sellingPrice": 3699,
    "width": 15.1,
    "height": 11,
    "length": 10.2,
    "weight": 1164
  },
  {
    "productName": "OM System OM-1",
    "brandName": "OM System",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The OM System OM-1 is a professional Micro Four Thirds mirrorless camera. It offers fast autofocus and excellent stabilization. This camera is ideal for wildlife and outdoor photography. Its weather-sealed body ensures durability.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 13.4,
    "height": 9.1,
    "length": 6.9,
    "weight": 599
  },
  {
    "productName": "Leica Q3",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Leica Q3 is a premium compact full-frame camera with a fixed lens. It delivers outstanding sharpness and color rendition. This camera is ideal for street and documentary photography. Its minimalist design emphasizes craftsmanship.",
    "price": 5999,
    "sellingPrice": 5699,
    "width": 13,
    "height": 8,
    "length": 9.2,
    "weight": 743
  },
  {
    "productName": "Pentax K-S2",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Pentax K-S2 is a weather-sealed DSLR aimed at enthusiasts. It offers good image quality and reliable autofocus. This camera is suitable for outdoor photography. Its compact body improves handling.",
    "price": 649,
    "sellingPrice": 589,
    "width": 12.3,
    "height": 9.1,
    "length": 7.3,
    "weight": 618
  },
  {
    "productName": "Ricoh GR Digital IV",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Ricoh GR Digital IV is a compact camera designed for everyday photography. It delivers good sharpness and fast response. This camera is popular for casual street shooting. Its slim body enhances portability.",
    "price": 499,
    "sellingPrice": 449,
    "width": 10.7,
    "height": 5.9,
    "length": 3.1,
    "weight": 219
  },
  {
    "productName": "DJI Osmo Pocket 3",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI Osmo Pocket 3 is a handheld camera with advanced stabilization. It delivers smooth video and high-quality photos. This camera is ideal for vloggers and travelers. Its compact design fits easily in a pocket.",
    "price": 519,
    "sellingPrice": 489,
    "width": 3.9,
    "height": 12.8,
    "length": 3.1,
    "weight": 179
  },
  {
    "productName": "Canon EOS 1D X Mark III",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Canon EOS 1D X Mark III is a professional DSLR built for speed and durability. It excels in sports and wildlife photography. This camera delivers fast autofocus and excellent low-light performance. Its rugged body supports demanding environments.",
    "price": 6499,
    "sellingPrice": 6199,
    "width": 15.8,
    "height": 16.8,
    "length": 8.3,
    "weight": 1440
  },
  {
    "productName": "Sony Alpha A7",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sony Alpha A7 is an early full-frame mirrorless camera with compact design. It offers solid image quality and interchangeable lenses. This camera is suitable for enthusiasts exploring full-frame systems. Its lightweight body improves portability.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 12.7,
    "height": 9.4,
    "length": 6.3,
    "weight": 474
  },
  {
    "productName": "Nikon Coolpix P950",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Nikon Coolpix P950 is a superzoom bridge camera with extreme focal range. It is ideal for wildlife and astronomy photography. This camera eliminates the need for lens changes. Its large grip ensures comfortable handling.",
    "price": 899,
    "sellingPrice": 829,
    "width": 14,
    "height": 11,
    "length": 13,
    "weight": 1005
  },
  {
    "productName": "Fujifilm X-M1",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Fujifilm X-M1 is a compact mirrorless camera designed for everyday photography. It offers good image quality and simple controls. This camera is suitable for beginners. Its lightweight design improves portability.",
    "price": 549,
    "sellingPrice": 499,
    "width": 11.6,
    "height": 7,
    "length": 3.9,
    "weight": 330
  },
  {
    "productName": "Panasonic Lumix GX80",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Panasonic Lumix GX80 is a compact mirrorless camera with in-body stabilization. It delivers solid image quality and video performance. This camera is ideal for travel and street photography. Its compact size enhances mobility.",
    "price": 649,
    "sellingPrice": 589,
    "width": 12.2,
    "height": 7.1,
    "length": 4.4,
    "weight": 426
  },
  {
    "productName": "Hasselblad H5D-50c",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Hasselblad H5D-50c is a professional medium format camera for studio photography. It delivers exceptional detail and color accuracy. This camera is widely used in commercial studios. Its build quality reflects professional standards.",
    "price": 24999,
    "sellingPrice": 22999,
    "width": 15.6,
    "height": 12.3,
    "length": 16.1,
    "weight": 2400
  },
  {
    "productName": "Canon IXUS 185",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4,
    "description": "The Canon IXUS 185 is a simple point-and-shoot camera for casual photography. It offers basic zoom and automatic shooting modes. This camera is easy to use for beginners. Its slim body fits easily in a pocket.",
    "price": 179,
    "sellingPrice": 159,
    "width": 9.5,
    "height": 5.4,
    "length": 2.2,
    "weight": 126
  },
  {
    "productName": "Sony Cyber-shot HX99",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sony Cyber-shot HX99 is a compact travel camera with a powerful zoom. It delivers good image quality in a small form factor. This camera is ideal for travel photography. Its pop-up viewfinder adds flexibility.",
    "price": 549,
    "sellingPrice": 499,
    "width": 10.2,
    "height": 5.8,
    "length": 3.6,
    "weight": 242
  },
  {
    "productName": "Insta360 Link",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Insta360 Link is a high-quality AI-powered webcam camera. It delivers sharp video and intelligent tracking. This camera is ideal for streaming and video calls. Its compact design fits easily on monitors.",
    "price": 299,
    "sellingPrice": 269,
    "width": 6.3,
    "height": 4.8,
    "length": 3.6,
    "weight": 106
  },
  {
    "productName": "Fujifilm X-T3",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Fujifilm X-T3 is a compact mirrorless camera known for excellent color science. It delivers strong photo and video performance. This camera is suitable for enthusiasts and professionals. Its classic controls improve usability.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 13.3,
    "height": 9.2,
    "length": 5.9,
    "weight": 539
  },
  {
    "productName": "Panasonic Lumix S1R",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Panasonic Lumix S1R is a high-resolution full-frame mirrorless camera. It delivers excellent image quality and color depth. This camera is ideal for studio and landscape photography. Its rugged body supports professional workflows.",
    "price": 3699,
    "sellingPrice": 3399,
    "width": 14.9,
    "height": 11,
    "length": 9.6,
    "weight": 1016
  },
  {
    "productName": "OM System OM-5",
    "brandName": "OM System",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The OM System OM-5 is a compact mirrorless camera designed for outdoor use. It offers effective stabilization and weather sealing. This camera is ideal for travel and hiking photography. Its lightweight body improves portability.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 12.5,
    "height": 8.5,
    "length": 4.9,
    "weight": 414
  },
  {
    "productName": "Ricoh G900",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Ricoh G900 is a rugged compact camera designed for industrial and outdoor use. It is waterproof, shockproof, and dustproof. This camera is ideal for harsh environments. Its durable construction ensures long-term reliability.",
    "price": 799,
    "sellingPrice": 749,
    "width": 11.9,
    "height": 6.5,
    "length": 3.2,
    "weight": 257
  },
  {
    "productName": "DJI Mini 3 Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The DJI Mini 3 Camera is designed for compact aerial photography. It delivers sharp images with stabilized footage. This camera is ideal for travel and beginners. Its lightweight design allows extended flight time.",
    "price": 599,
    "sellingPrice": 549,
    "width": 6.5,
    "height": 5.2,
    "length": 4.1,
    "weight": 249
  },
  {
    "productName": "Canon EOS 80D",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Canon EOS 80D is a mid-range DSLR offering solid performance and image quality. It features reliable autofocus and ergonomic controls. This camera is suitable for enthusiasts. Its robust body supports everyday use.",
    "price": 999,
    "sellingPrice": 899,
    "width": 13.9,
    "height": 10.5,
    "length": 7.9,
    "weight": 730
  },
  {
    "productName": "Sony Alpha A5100",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Sony Alpha A5100 is a compact mirrorless camera for casual photographers. It delivers good image quality in a small body. This camera is easy to use and portable. Its lightweight design supports travel photography.",
    "price": 549,
    "sellingPrice": 499,
    "width": 10.9,
    "height": 6.3,
    "length": 3.6,
    "weight": 283
  },
  {
    "productName": "Nikon D610",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Nikon D610 is a full-frame DSLR designed for enthusiasts. It delivers strong image quality and low-light performance. This camera is suitable for portrait and landscape photography. Its durable body ensures long-term use.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 14.2,
    "height": 11.3,
    "length": 8.2,
    "weight": 850
  },
  {
    "productName": "Fujifilm X20",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Fujifilm X20 is a compact camera with retro styling and manual controls. It offers good image quality for its class. This camera is ideal for everyday shooting. Its small size improves portability.",
    "price": 499,
    "sellingPrice": 449,
    "width": 11.7,
    "height": 6.9,
    "length": 5.7,
    "weight": 353
  },
  {
    "productName": "Panasonic Lumix GF10",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Panasonic Lumix GF10 is a compact mirrorless camera for beginners. It offers simple controls and decent image quality. This camera is ideal for casual photography. Its lightweight design makes it easy to carry.",
    "price": 549,
    "sellingPrice": 499,
    "width": 10.7,
    "height": 6.7,
    "length": 3.3,
    "weight": 270
  },
  {
    "productName": "Hasselblad X2D 50C",
    "brandName": "Hasselblad",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Hasselblad X2D 50C is a medium format mirrorless camera with premium image quality. It delivers outstanding detail and dynamic range. This camera is designed for professional photography. Its refined design enhances usability.",
    "price": 5999,
    "sellingPrice": 5699,
    "width": 14.8,
    "height": 10.6,
    "length": 7.4,
    "weight": 895
  },
  {
    "productName": "Canon PowerShot A4000 IS",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4,
    "description": "The Canon PowerShot A4000 IS is a compact point-and-shoot camera for casual users. It offers simple operation and basic image quality. This camera is suitable for everyday snapshots. Its slim body fits easily in a pocket.",
    "price": 199,
    "sellingPrice": 179,
    "width": 9.4,
    "height": 5.7,
    "length": 2.1,
    "weight": 145
  },
  {
    "productName": "Sony DSC-WX500",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sony DSC-WX500 is a compact travel camera with a powerful zoom lens. It delivers good image quality in a small form factor. This camera is ideal for travel photography. Its flip-up screen supports selfies and vlogging.",
    "price": 349,
    "sellingPrice": 319,
    "width": 10.2,
    "height": 5.8,
    "length": 3.6,
    "weight": 236
  },
  {
    "productName": "Insta360 Pro 2",
    "brandName": "Insta360",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Insta360 Pro 2 is a professional 360-degree camera for cinematic VR production. It delivers high-resolution immersive video. This camera is used in professional virtual reality projects. Its robust design supports studio and outdoor use.",
    "price": 4999,
    "sellingPrice": 4699,
    "width": 14,
    "height": 14,
    "length": 14,
    "weight": 1550
  },
  {
    "productName": "OM System Tough TG-7",
    "brandName": "OM System",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The OM System Tough TG-7 is a rugged compact camera built for extreme conditions. It is waterproof, shockproof, and freeze-proof. This camera is ideal for adventure and underwater photography. Its durable design ensures reliability.",
    "price": 499,
    "sellingPrice": 469,
    "width": 11.3,
    "height": 6.6,
    "length": 3.2,
    "weight": 249
  },
  {
    "productName": "Ricoh Theta X",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Ricoh Theta X is a compact 360-degree camera designed for immersive photography. It captures high-quality spherical images. This camera is suitable for virtual tours and creative content. Its touchscreen improves usability.",
    "price": 799,
    "sellingPrice": 749,
    "width": 5.1,
    "height": 13,
    "length": 2.9,
    "weight": 170
  },
  {
    "productName": "Panasonic Lumix LX15",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Panasonic Lumix LX15 is a compact camera with a fast lens. It delivers strong low-light performance. This camera is ideal for everyday and travel photography. Its small size makes it easy to carry.",
    "price": 599,
    "sellingPrice": 549,
    "width": 10.6,
    "height": 6,
    "length": 4.2,
    "weight": 310
  },
  {
    "productName": "Nikon Coolpix A1000",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Nikon Coolpix A1000 is a compact travel camera with a large zoom range. It delivers good image quality for its size. This camera is ideal for travel photography. Its pop-up viewfinder adds flexibility.",
    "price": 699,
    "sellingPrice": 649,
    "width": 11.4,
    "height": 6.6,
    "length": 4.1,
    "weight": 330
  },
  {
    "productName": "OM System Pen E-P7",
    "brandName": "OM System",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The OM System Pen E-P7 is a stylish compact mirrorless camera. It delivers good image quality in a lightweight design. This camera is suitable for everyday photography. Its retro look appeals to casual shooters.",
    "price": 799,
    "sellingPrice": 739,
    "width": 11.7,
    "height": 6.9,
    "length": 3.8,
    "weight": 337
  },
  {
    "productName": "Sony DSC-HX400V",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sony DSC-HX400V is a bridge camera with a powerful zoom lens. It delivers good image quality for distant subjects. This camera is suitable for wildlife and travel photography. Its DSLR-style body improves grip.",
    "price": 599,
    "sellingPrice": 549,
    "width": 13,
    "height": 9.3,
    "length": 10.4,
    "weight": 660
  },
  {
    "productName": "Canon EOS R10",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Canon EOS R10 is a compact APS-C mirrorless camera designed for speed and portability. It features fast autofocus with subject tracking and strong burst performance. This camera is ideal for travel, wildlife, and everyday photography. Its lightweight body makes it easy to carry for extended shooting sessions.",
    "price": 979,
    "sellingPrice": 899,
    "width": 12.3,
    "height": 8.7,
    "length": 8.3,
    "weight": 429
  },
  {
    "productName": "Sony Alpha A7 IV",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Sony Alpha A7 IV is a versatile full-frame mirrorless camera balancing resolution, speed, and video performance. It offers advanced autofocus with real-time tracking and excellent image quality. This model suits hybrid shooters working in both photography and video. Its refined ergonomics support long professional workflows.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 13.1,
    "height": 9.6,
    "length": 8,
    "weight": 658
  },
  {
    "productName": "Nikon Z5",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Nikon Z5 is an entry-level full-frame mirrorless camera offering solid image quality and reliable autofocus. It is designed for photographers transitioning to full-frame systems. This camera performs well in portraits and landscape photography. Its weather-sealed body adds durability for outdoor use.",
    "price": 1399,
    "sellingPrice": 1249,
    "width": 13.4,
    "height": 10.1,
    "length": 6.9,
    "weight": 675
  },
  {
    "productName": "Fujifilm X-T30 II",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Fujifilm X-T30 II is a compact mirrorless camera delivering excellent image quality in a small body. It features advanced autofocus and Fujifilm’s signature color profiles. This camera is ideal for travel, street, and everyday photography. Its lightweight design enhances portability.",
    "price": 899,
    "sellingPrice": 829,
    "width": 11.8,
    "height": 8.3,
    "length": 4.7,
    "weight": 329
  },
  {
    "productName": "Panasonic Lumix S5 II",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Panasonic Lumix S5 II is a full-frame mirrorless camera focused on hybrid shooting. It delivers excellent video performance with phase-detection autofocus. This camera is suitable for filmmakers and content creators. Its compact body improves mobility during production.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 13.4,
    "height": 10.2,
    "length": 9,
    "weight": 740
  },
  {
    "productName": "Olympus OM-D E-M10 Mark III",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Olympus OM-D E-M10 Mark III is a compact mirrorless camera designed for beginners. It offers in-body stabilization and intuitive controls. This camera is ideal for learning photography and travel shooting. Its lightweight body enhances everyday usability.",
    "price": 649,
    "sellingPrice": 589,
    "width": 12.1,
    "height": 8.4,
    "length": 4.9,
    "weight": 410
  },
  {
    "productName": "Leica S3",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Leica S3 is a professional medium format DSLR delivering exceptional image quality and color accuracy. It is built for studio and commercial photography. This camera offers outstanding dynamic range and detail. Its rugged construction supports demanding professional workflows.",
    "price": 18999,
    "sellingPrice": 17999,
    "width": 16,
    "height": 12,
    "length": 8.5,
    "weight": 1260
  },
  {
    "productName": "Ricoh GR II",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Ricoh GR II is a compact camera optimized for street photography. It delivers sharp images and fast response in a pocket-sized body. This camera is ideal for photographers who value discretion and speed. Its minimalist design supports quick shooting.",
    "price": 699,
    "sellingPrice": 629,
    "width": 11.7,
    "height": 6.1,
    "length": 3.4,
    "weight": 251
  },
  {
    "productName": "DJI Ronin 4D Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Ronin 4D Camera is a professional cinema system with integrated stabilization. It delivers cinematic image quality and advanced autofocus. This camera is designed for film and commercial production. Its modular design supports flexible shooting configurations.",
    "price": 7199,
    "sellingPrice": 6899,
    "width": 23.5,
    "height": 13,
    "length": 18,
    "weight": 4600
  },
  {
    "productName": "Pentax K-50",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Pentax K-50 is a weather-sealed DSLR suitable for outdoor photography. It offers reliable image quality and solid autofocus performance. This camera is ideal for travel and landscape shooting. Its rugged body ensures durability in harsh conditions.",
    "price": 599,
    "sellingPrice": 549,
    "width": 12.9,
    "height": 9.6,
    "length": 7,
    "weight": 649
  },
  {
    "productName": "Canon EOS M6 Mark II",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Canon EOS M6 Mark II is a compact mirrorless camera with high resolution and fast autofocus. It delivers excellent image quality and strong performance in both stills and video. Ideal for travel and street photography.",
    "price": 899,
    "sellingPrice": 799,
    "width": 11.9,
    "height": 7.4,
    "length": 4.8,
    "weight": 408
  },
  {
    "productName": "Sony A1R II",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Sony A1R II is a high-resolution full-frame mirrorless camera built for professional photography. It offers outstanding image quality and advanced autofocus systems. This camera suits studio, landscape, and commercial work.",
    "price": 6999,
    "sellingPrice": 6699,
    "width": 13,
    "height": 9.8,
    "length": 8.3,
    "weight": 738
  },
  {
    "productName": "Nikon Z30 II",
    "brandName": "Nikon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Nikon Z30 II is an upgraded compact mirrorless camera with enhanced video capabilities. It’s perfect for vloggers, content creators, and travel photographers who want a reliable all-around performer.",
    "price": 799,
    "sellingPrice": 749,
    "width": 12.8,
    "height": 7.3,
    "length": 5.9,
    "weight": 355
  },
  {
    "productName": "Fujifilm X100T",
    "brandName": "Fujifilm",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Fujifilm X100T is a classic compact camera with a fixed lens and traditional controls. It delivers strong image quality and beautiful color rendering, perfect for street and everyday photography.",
    "price": 1199,
    "sellingPrice": 1099,
    "width": 12.6,
    "height": 7.4,
    "length": 5.1,
    "weight": 469
  },
  {
    "productName": "Panasonic Lumix G7",
    "brandName": "Panasonic",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Panasonic Lumix G7 is a versatile mirrorless camera built for hybrid shooters who value 4K video and strong ergonomics. Its user-friendly design makes it great for beginners and enthusiasts alike.",
    "price": 599,
    "sellingPrice": 549,
    "width": 12.3,
    "height": 8.3,
    "length": 7.1,
    "weight": 410
  },
  {
    "productName": "Olympus OM-D E-M5 Mark III",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Olympus OM-D E-M5 Mark III is a feature-rich mirrorless camera with excellent stabilization and performance for travel and nature photography. Its compact body pairs well with versatile Micro Four Thirds lenses.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 12.3,
    "height": 9.1,
    "length": 6.9,
    "weight": 502
  },
  {
    "productName": "Leica Q-P",
    "brandName": "Leica",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The Leica Q-P is a premium compact full-frame camera with iconic Leica design and superb optics. It excels at street, travel, and documentary photography with its fixed high-quality lens.",
    "price": 4999,
    "sellingPrice": 4799,
    "width": 13,
    "height": 8,
    "length": 9.2,
    "weight": 734
  },
  {
    "productName": "Ricoh WG-70",
    "brandName": "Ricoh",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Ricoh WG-70 is a rugged action camera designed for adventurers and outdoor enthusiasts. It delivers reliable performance in extreme conditions with waterproof and shockproof build.",
    "price": 329,
    "sellingPrice": 299,
    "width": 11.8,
    "height": 6.6,
    "length": 3.3,
    "weight": 248
  },
  {
    "productName": "DJI Air 2S Camera",
    "brandName": "DJI",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Air 2S Camera is a high-performance drone camera system with 1-inch sensor capture and intelligent flight features. It’s ideal for aerial photography and videography enthusiasts seeking compact power.",
    "price": 999,
    "sellingPrice": 949,
    "width": 17,
    "height": 7.5,
    "length": 9.2,
    "weight": 595
  },
  {
    "productName": "Pentax KP II",
    "brandName": "Pentax",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Pentax KP II is a rugged DSLR built for outdoor and enthusiast photographers. It offers strong performance with weather sealing, excellent handling, and bright optical quality.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 13.2,
    "height": 10.1,
    "length": 7.6,
    "weight": 705
  },
  {
    "productName": "OM System OM-6",
    "brandName": "OM System",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The OM System OM-6 is a modern Micro Four Thirds mirrorless camera offering powerful autofocus, great low-light performance, and robust construction. Designed for outdoor and travel photographers who want pro-level features in a light body.",
    "price": 1599,
    "sellingPrice": 1499,
    "width": 12.9,
    "height": 9.6,
    "length": 6.8,
    "weight": 665
  },
  {
    "productName": "Canon EOS R50",
    "brandName": "Canon",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Canon EOS R50 is an entry-level mirrorless camera designed for beginners and content creators. It offers fast autofocus and solid image quality in a compact body. Ideal for everyday photography and vlogging. Its lightweight build makes it easy to carry.",
    "price": 749,
    "sellingPrice": 699,
    "width": 11.6,
    "height": 8.5,
    "length": 6.8,
    "weight": 375
  },
  {
    "productName": "Sony A6400",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Sony A6400 is a compact APS-C mirrorless camera with excellent autofocus performance. It is popular among vloggers and travel photographers. The camera delivers sharp images and fast tracking. Its tilting screen improves usability.",
    "price": 899,
    "sellingPrice": 829,
    "width": 12,
    "height": 6.7,
    "length": 6,
    "weight": 403
  },
  {
    "productName": "Sony FX30",
    "brandName": "Sony",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Sony FX30 is a cinema-focused APS-C camera designed for filmmakers. It delivers high-quality video with advanced color science. The camera integrates well into professional workflows. Compact size allows flexible rigging.",
    "price": 1999,
    "sellingPrice": 1899,
    "width": 12.9,
    "height": 7.7,
    "length": 8.4,
    "weight": 646
  },
  {
    "productName": "Olympus Tough TG-6",
    "brandName": "Olympus",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The Olympus Tough TG-6 is a rugged compact camera designed for extreme conditions. It is waterproof, shockproof, and freezeproof. Ideal for adventure and outdoor photography. Reliable performance in harsh environments.",
    "price": 499,
    "sellingPrice": 459,
    "width": 11.3,
    "height": 6.6,
    "length": 3.2,
    "weight": 253
  },
  {
    "productName": "Phase One XF IQ4 150MP",
    "brandName": "Phase One",
    "productType": "camera",
    "productImages": [],
    "rating": 5,
    "description": "The Phase One XF IQ4 150MP is a flagship medium format camera system built for ultra-high-end commercial photography. It delivers unmatched resolution and image fidelity. This camera is used in fashion, art, and archival photography. Designed for studio environments.",
    "price": 49999,
    "sellingPrice": 48999,
    "width": 16,
    "height": 13.5,
    "length": 8.5,
    "weight": 1560
  },
  {
    "productName": "Sigma fp L",
    "brandName": "Sigma",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Sigma fp L is a compact full-frame mirrorless camera emphasizing modular design and portability. It offers high-resolution stills and strong video capabilities. Ideal for photographers who value flexibility. Its minimalist body supports custom rigs.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 11.2,
    "height": 7,
    "length": 4.5,
    "weight": 427
  },
  {
    "productName": "Z CAM E2-F6",
    "brandName": "Z CAM",
    "productType": "camera",
    "productImages": [],
    "rating": 4.7,
    "description": "The Z CAM E2-F6 is a professional cinema camera designed for filmmakers and production studios. It supports high dynamic range and RAW video recording. Compact cube design allows flexible mounting. Popular in indie film production.",
    "price": 3999,
    "sellingPrice": 3799,
    "width": 9.1,
    "height": 9.6,
    "length": 10,
    "weight": 900
  },
  {
    "productName": "RED Komodo 6K",
    "brandName": "RED",
    "productType": "camera",
    "productImages": [],
    "rating": 4.9,
    "description": "The RED Komodo 6K is a compact cinema camera delivering high-quality cinematic footage. It features a global shutter and robust color science. Designed for professional filmmakers. Its small form factor enables versatile shooting setups.",
    "price": 5995,
    "sellingPrice": 5795,
    "width": 10.2,
    "height": 10.2,
    "length": 10.2,
    "weight": 950
  },
  {
    "productName": "Arri Alexa Mini LF",
    "brandName": "ARRI",
    "productType": "camera",
    "productImages": [],
    "rating": 5,
    "description": "The ARRI Alexa Mini LF is a high-end cinema camera used in major film productions. It delivers exceptional dynamic range and cinematic color reproduction. Designed for professional filmmaking crews. Renowned for reliability and image quality.",
    "price": 58900,
    "sellingPrice": 56900,
    "width": 18.5,
    "height": 14,
    "length": 19,
    "weight": 2600
  },
  {
    "productName": "YI 4K Plus Action Camera",
    "brandName": "YI Technology",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The YI 4K Plus Action Camera offers high-resolution video recording in a compact form. It is designed for sports and outdoor activities. Lightweight and durable for active use. A budget-friendly alternative for action filming.",
    "price": 299,
    "sellingPrice": 269,
    "width": 6.5,
    "height": 4.2,
    "length": 3,
    "weight": 123
  },
  {
    "productName": "Kodak PixPro AZ528",
    "brandName": "Kodak",
    "productType": "camera",
    "productImages": [],
    "rating": 4.2,
    "description": "The Kodak PixPro AZ528 is a bridge camera offering a powerful zoom range for versatile shooting. It is suitable for beginners and travel photography. The camera provides easy handling and good reach. Ideal for everyday use.",
    "price": 399,
    "sellingPrice": 369,
    "width": 12.1,
    "height": 8.5,
    "length": 9.8,
    "weight": 508
  },
  {
    "productName": "Leofoto LVF-163C Camera System",
    "brandName": "Leofoto",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Leofoto LVF-163C Camera System is a niche modular imaging solution designed for specialized photography setups. It supports custom mounting and precision shooting. Built for experimental and technical use cases. Durable and adaptable construction.",
    "price": 1899,
    "sellingPrice": 1799,
    "width": 15.5,
    "height": 12,
    "length": 10.5,
    "weight": 2100
  },
  {
    "productName": "Casio Exilim EX-ZR2000",
    "brandName": "Casio",
    "productType": "camera",
    "productImages": [],
    "rating": 4.1,
    "description": "The Casio Exilim EX-ZR2000 is a compact camera designed for casual and travel photography. It offers fast startup and simple controls for everyday use. The camera is lightweight and portable. Ideal for users seeking simplicity and reliability.",
    "price": 349,
    "sellingPrice": 319,
    "width": 10.8,
    "height": 6.1,
    "length": 3.9,
    "weight": 202
  },
  {
    "productName": "Minolta MN67Z",
    "brandName": "Minolta",
    "productType": "camera",
    "productImages": [],
    "rating": 4,
    "description": "The Minolta MN67Z is a bridge camera featuring a long zoom lens and user-friendly design. It is suitable for beginners exploring photography. The camera balances reach and portability. Ideal for travel and casual shooting.",
    "price": 299,
    "sellingPrice": 279,
    "width": 11.8,
    "height": 8.4,
    "length": 9.1,
    "weight": 502
  },
  {
    "productName": "Sinar HY6 Mod2",
    "brandName": "Sinar",
    "productType": "camera",
    "productImages": [],
    "rating": 4.8,
    "description": "The Sinar HY6 Mod2 is a professional medium format camera system built for studio photography. It delivers exceptional image precision and modular flexibility. Designed for commercial and fine-art applications. Built with professional durability in mind.",
    "price": 28999,
    "sellingPrice": 27999,
    "width": 16.8,
    "height": 13.2,
    "length": 9.4,
    "weight": 1650
  },
  {
    "productName": "Holga 120N",
    "brandName": "Holga",
    "productType": "camera",
    "productImages": [],
    "rating": 3.9,
    "description": "The Holga 120N is a classic plastic film camera known for its lo-fi aesthetic. It is popular among experimental and artistic photographers. The camera produces unique, unpredictable results. Simple construction encourages creative freedom.",
    "price": 59,
    "sellingPrice": 49,
    "width": 12,
    "height": 9,
    "length": 8,
    "weight": 450
  },
  {
    "productName": "Lomography Diana F+",
    "brandName": "Lomography",
    "productType": "camera",
    "productImages": [],
    "rating": 4,
    "description": "The Lomography Diana F+ is a medium format film camera designed for creative photography. It produces soft focus and vivid colors. Popular among analog enthusiasts. Lightweight and fun to use.",
    "price": 99,
    "sellingPrice": 89,
    "width": 11.5,
    "height": 9.5,
    "length": 8.5,
    "weight": 460
  },
  {
    "productName": "Polaroid Now+",
    "brandName": "Polaroid",
    "productType": "camera",
    "productImages": [],
    "rating": 4.3,
    "description": "The Polaroid Now+ is an instant camera offering classic instant photography with modern features. It supports creative shooting modes via mobile connectivity. Ideal for social events and creative expression. Produces iconic instant prints.",
    "price": 149,
    "sellingPrice": 139,
    "width": 15,
    "height": 11.2,
    "length": 9.4,
    "weight": 457
  },
  {
    "productName": "Sigma BF-1 Camera Module",
    "brandName": "Sigma",
    "productType": "camera",
    "productImages": [],
    "rating": 4.4,
    "description": "The Sigma BF-1 Camera Module is a conceptual modular camera designed for experimental photography setups. It emphasizes customization and modular expansion. Built for advanced users and developers. Suitable for research and prototyping.",
    "price": 1799,
    "sellingPrice": 1699,
    "width": 13,
    "height": 8,
    "length": 6.5,
    "weight": 720
  },
  {
    "productName": "Sharp 8K Video Camera C10",
    "brandName": "Sharp",
    "productType": "camera",
    "productImages": [],
    "rating": 4.6,
    "description": "The Sharp 8K Video Camera C10 is a professional video camera capable of ultra-high-resolution recording. Designed for broadcast and cinematic production. It offers advanced video codecs and professional connectivity. Built for studio and field use.",
    "price": 3499,
    "sellingPrice": 3299,
    "width": 18,
    "height": 12.5,
    "length": 16,
    "weight": 2100
  },
  {
    "productName": "Vivitar ViviCam X048",
    "brandName": "Vivitar",
    "productType": "camera",
    "productImages": [],
    "rating": 3.8,
    "description": "The Vivitar ViviCam X048 is a budget-friendly compact camera designed for basic photography needs. It is easy to use and lightweight. Suitable for casual snapshots and travel. Offers simple operation at an affordable price.",
    "price": 89,
    "sellingPrice": 79,
    "width": 9.8,
    "height": 6.2,
    "length": 3.5,
    "weight": 178
  },
  {
    "productName": "GoPro MAX 360",
    "brandName": "GoPro",
    "productType": "camera",
    "productImages": [],
    "rating": 4.5,
    "description": "The GoPro MAX 360 is a versatile action camera capable of capturing immersive 360-degree footage. It features advanced stabilization and rugged construction. Ideal for adventure sports and creative content. Compact and durable design.",
    "price": 499,
    "sellingPrice": 469,
    "width": 6.9,
    "height": 6.4,
    "length": 3.3,
    "weight": 163
  }
]