[
  {
    "productName": "DJI Mini 3 Pro",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The DJI Mini 3 Pro is a compact and lightweight drone designed for both beginners and experienced pilots. It offers excellent image quality with advanced stabilization and obstacle sensing. The drone is ideal for travel, aerial photography, and casual videography. Its lightweight design allows operation in regions with fewer flight restrictions.",
    "price": 759,
    "sellingPrice": 699,
    "width": 14.5,
    "height": 6.2,
    "length": 9,
    "weight": 249
  },
  {
    "productName": "DJI Air 3",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Air 3 is a powerful mid-range drone featuring dual cameras for versatile aerial shooting. It delivers excellent flight stability, long battery life, and advanced safety features. This drone is suitable for content creators and enthusiasts. Its intelligent flight modes enable cinematic footage with minimal effort.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 18.3,
    "height": 7.7,
    "length": 14.5,
    "weight": 720
  },
  {
    "productName": "DJI Mavic 3 Classic",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Mavic 3 Classic is a professional drone designed for high-quality aerial photography and videography. It features a large sensor camera with excellent dynamic range. The drone offers long flight time and precise positioning. Its advanced obstacle avoidance system enhances flight safety.",
    "price": 1599,
    "sellingPrice": 1499,
    "width": 22.1,
    "height": 9.6,
    "length": 18,
    "weight": 895
  },
  {
    "productName": "Autel EVO Lite+",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Autel EVO Lite+ is a premium drone offering excellent low-light performance and long flight endurance. It is designed for aerial photographers who need flexibility and reliability. The drone features advanced obstacle avoidance and intelligent flight modes. Its foldable design improves portability.",
    "price": 1249,
    "sellingPrice": 1149,
    "width": 21,
    "height": 8.5,
    "length": 17,
    "weight": 835
  },
  {
    "productName": "Autel EVO Nano+",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Autel EVO Nano+ is a lightweight drone designed for easy transport and quick deployment. It offers strong image quality and reliable stabilization despite its small size. This drone is ideal for beginners and travelers. Its compact body allows operation in restricted airspace categories.",
    "price": 649,
    "sellingPrice": 599,
    "width": 13.5,
    "height": 5.5,
    "length": 8.5,
    "weight": 249
  },
  {
    "productName": "Parrot Anafi",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Parrot Anafi is a lightweight foldable drone designed for portability and ease of use. It features a unique 180-degree tilting camera for creative angles. The drone is suitable for travel and landscape photography. Its quiet operation makes it ideal for urban environments.",
    "price": 699,
    "sellingPrice": 629,
    "width": 17.5,
    "height": 6.7,
    "length": 14,
    "weight": 320
  },
  {
    "productName": "Skydio 2+",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The Skydio 2+ is an autonomous drone built with advanced AI-powered obstacle avoidance. It excels in tracking subjects through complex environments. This drone is ideal for action sports and dynamic filming. Its intelligent navigation reduces the need for manual control.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 22,
    "height": 8,
    "length": 18.5,
    "weight": 800
  },
  {
    "productName": "DJI FPV",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The DJI FPV drone delivers an immersive first-person flying experience with high-speed performance. It is designed for adrenaline-filled flight and cinematic action shots. The drone features robust stabilization and emergency safety modes. Its aerodynamic design supports fast and agile movement.",
    "price": 1299,
    "sellingPrice": 1199,
    "width": 25.5,
    "height": 12.7,
    "length": 31,
    "weight": 795
  },
  {
    "productName": "DJI Avata",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI Avata is a compact FPV drone designed for immersive indoor and outdoor flying. It offers strong stabilization and responsive controls. This drone is suitable for cinematic FPV shots and creative angles. Its ducted propellers improve safety during close-range flights.",
    "price": 1169,
    "sellingPrice": 1099,
    "width": 18,
    "height": 8,
    "length": 18,
    "weight": 410
  },
  {
    "productName": "Yuneec Typhoon H Plus",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Yuneec Typhoon H Plus is a professional hexacopter designed for stability and safety. It features a retractable landing gear and 360-degree camera rotation. This drone is well suited for professional video production. Its six-rotor design enhances redundancy and control.",
    "price": 1799,
    "sellingPrice": 1649,
    "width": 52,
    "height": 22,
    "length": 52,
    "weight": 1995
  },
  {
    "productName": "DJI Mini 4 Pro",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Mini 4 Pro is a compact and powerful drone designed for creators who value portability. It delivers excellent image stabilization and advanced obstacle avoidance. This drone is ideal for travel and aerial photography. Its lightweight design allows easy operation in many regions.",
    "price": 829,
    "sellingPrice": 769,
    "width": 14.8,
    "height": 6.4,
    "length": 9.2,
    "weight": 249
  },
  {
    "productName": "DJI Mavic Air 2S",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The DJI Mavic Air 2S is a versatile drone with a large sensor camera for high-quality aerial footage. It offers excellent flight stability and intelligent tracking modes. This drone is suitable for both enthusiasts and professionals. Its foldable design improves portability.",
    "price": 999,
    "sellingPrice": 899,
    "width": 18,
    "height": 7.7,
    "length": 14.2,
    "weight": 595
  },
  {
    "productName": "Autel EVO II Pro",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The Autel EVO II Pro is a professional-grade drone featuring a large sensor camera. It delivers excellent image quality and long flight time. This drone is ideal for commercial aerial photography. Its rugged design ensures reliable performance.",
    "price": 1799,
    "sellingPrice": 1699,
    "width": 23,
    "height": 9.5,
    "length": 19,
    "weight": 1191
  },
  {
    "productName": "Parrot Anafi USA",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Parrot Anafi USA is a rugged drone designed for professional and industrial use. It features a secure data system and advanced zoom camera. This drone is suitable for inspection and surveillance tasks. Its lightweight body supports extended flight.",
    "price": 6999,
    "sellingPrice": 6599,
    "width": 17.5,
    "height": 6.7,
    "length": 14,
    "weight": 500
  },
  {
    "productName": "Skydio X2",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The Skydio X2 is an advanced autonomous drone designed for enterprise and public safety. It features AI-powered obstacle avoidance and secure communication. This drone excels in complex environments. Its robust build supports professional operations.",
    "price": 10999,
    "sellingPrice": 10499,
    "width": 22.5,
    "height": 8.5,
    "length": 19,
    "weight": 1200
  },
  {
    "productName": "DJI Inspire 2",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The DJI Inspire 2 is a professional drone designed for cinematic video production. It delivers powerful performance and interchangeable camera support. This drone is widely used in film and television production. Its dual battery system improves safety.",
    "price": 3299,
    "sellingPrice": 3099,
    "width": 42.7,
    "height": 10.5,
    "length": 42.7,
    "weight": 3440
  },
  {
    "productName": "Yuneec Mantis Q",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Yuneec Mantis Q is a compact drone designed for beginners and casual pilots. It offers simple controls and decent image quality. This drone is suitable for learning aerial photography. Its foldable design enhances portability.",
    "price": 499,
    "sellingPrice": 449,
    "width": 18,
    "height": 6,
    "length": 14,
    "weight": 480
  },
  {
    "productName": "DJI Phantom 4 Pro V2.0",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Phantom 4 Pro V2.0 is a professional drone with exceptional image quality. It delivers precise flight control and advanced obstacle sensing. This drone is ideal for mapping and photography. Its solid build ensures stability.",
    "price": 1599,
    "sellingPrice": 1499,
    "width": 35,
    "height": 19,
    "length": 35,
    "weight": 1388
  },
  {
    "productName": "PowerVision PowerEgg X",
    "brandName": "PowerVision",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The PowerVision PowerEgg X is a versatile drone designed for both air and water use. It offers stable flight and unique waterproof capabilities. This drone is suitable for creative filming. Its modular design adds flexibility.",
    "price": 899,
    "sellingPrice": 829,
    "width": 22,
    "height": 9,
    "length": 22,
    "weight": 862
  },
  {
    "productName": "DJI Mini SE",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The DJI Mini SE is an entry-level drone designed for beginners. It offers stable flight and simple controls. This drone is ideal for casual aerial photography. Its lightweight design supports easy operation.",
    "price": 349,
    "sellingPrice": 319,
    "width": 13.8,
    "height": 5.8,
    "length": 8.1,
    "weight": 249
  },
  {
    "productName": "DJI Mavic 3 Pro",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Mavic 3 Pro is a flagship consumer drone designed for professional aerial photography. It features a triple-camera system for unmatched versatility. This drone delivers long flight time and precise control. Its advanced obstacle avoidance enhances safety during complex flights.",
    "price": 2199,
    "sellingPrice": 2099,
    "width": 22.1,
    "height": 9.6,
    "length": 18,
    "weight": 958
  },
  {
    "productName": "DJI Air 2",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI Air 2 is a compact and powerful drone aimed at enthusiasts. It offers strong image quality, reliable stabilization, and intelligent flight modes. This drone is suitable for travel and creative filming. Its foldable design improves portability.",
    "price": 799,
    "sellingPrice": 739,
    "width": 18,
    "height": 7.7,
    "length": 14.2,
    "weight": 570
  },
  {
    "productName": "Autel EVO II Dual 640T",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The Autel EVO II Dual 640T is a professional drone featuring both visual and thermal cameras. It is designed for inspection, search, and rescue operations. This drone delivers long endurance and strong obstacle avoidance. Its rugged build supports demanding missions.",
    "price": 8999,
    "sellingPrice": 8499,
    "width": 23,
    "height": 9.5,
    "length": 19,
    "weight": 1150
  },
  {
    "productName": "Parrot Bebop 2",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.1,
    "description": "The Parrot Bebop 2 is a lightweight consumer drone designed for casual aerial photography. It offers stable flight and simple controls. This drone is ideal for beginners and recreational pilots. Its compact design makes it easy to transport.",
    "price": 549,
    "sellingPrice": 499,
    "width": 32.8,
    "height": 11.8,
    "length": 38.2,
    "weight": 500
  },
  {
    "productName": "Skydio S2",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Skydio S2 is an autonomous drone designed for advanced subject tracking. It uses AI-based obstacle avoidance to navigate complex environments. This drone is ideal for sports and action filming. Its intelligent system minimizes pilot input.",
    "price": 1299,
    "sellingPrice": 1199,
    "width": 22,
    "height": 8,
    "length": 18.5,
    "weight": 775
  },
  {
    "productName": "DJI Matrice 30",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Matrice 30 is an enterprise-grade drone designed for industrial operations. It offers advanced sensors, weather resistance, and long-range transmission. This drone is suitable for inspection and emergency response. Its rugged design ensures reliability in harsh environments.",
    "price": 13999,
    "sellingPrice": 13499,
    "width": 66,
    "height": 43,
    "length": 66,
    "weight": 3700
  },
  {
    "productName": "Yuneec H520E",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Yuneec H520E is a professional hexacopter designed for inspection and mapping. It provides stable flight and redundancy with six rotors. This drone is widely used in industrial applications. Its modular payload system supports different cameras.",
    "price": 2799,
    "sellingPrice": 2599,
    "width": 52,
    "height": 22,
    "length": 52,
    "weight": 1900
  },
  {
    "productName": "DJI Mini 2 SE",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The DJI Mini 2 SE is a lightweight drone designed for beginners and casual users. It offers stable flight and good image quality. This drone is ideal for learning aerial photography. Its compact size enhances portability.",
    "price": 429,
    "sellingPrice": 399,
    "width": 13.8,
    "height": 5.8,
    "length": 8.1,
    "weight": 249
  },
  {
    "productName": "PowerVision PowerEgg X Wizard",
    "brandName": "PowerVision",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The PowerVision PowerEgg X Wizard is a versatile drone designed for both aerial and handheld use. It offers stable video recording and weather resistance. This drone is suitable for creative filming in different environments. Its modular design adds flexibility.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 22,
    "height": 9,
    "length": 22,
    "weight": 900
  },
  {
    "productName": "DJI Spark",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The DJI Spark is a compact drone designed for quick and easy flights. It offers gesture controls and simple operation. This drone is ideal for casual aerial photography. Its small size allows easy transport.",
    "price": 399,
    "sellingPrice": 349,
    "width": 14.3,
    "height": 5.5,
    "length": 14.3,
    "weight": 300
  },
  {
    "productName": "DJI Mavic Mini",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The DJI Mavic Mini is an ultra-lightweight drone designed for beginners and casual pilots. It delivers stable flight performance and decent image quality for its size. This drone is ideal for travel and quick aerial shots. Its compact form makes it easy to carry anywhere.",
    "price": 399,
    "sellingPrice": 349,
    "width": 13.8,
    "height": 5.8,
    "length": 8.1,
    "weight": 249
  },
  {
    "productName": "DJI Mini 2",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI Mini 2 is a compact drone offering improved transmission range and camera quality. It delivers smooth aerial footage and reliable stability. This drone is suitable for beginners and enthusiasts alike. Its lightweight design allows operation in many regions without licensing.",
    "price": 449,
    "sellingPrice": 399,
    "width": 13.8,
    "height": 5.8,
    "length": 8.1,
    "weight": 249
  },
  {
    "productName": "DJI FPV Combo",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI FPV Combo is designed for immersive first-person flight experiences. It offers high-speed performance and cinematic maneuverability. This drone is ideal for adrenaline-focused aerial filming. Its advanced safety features help pilots maintain control during fast flights.",
    "price": 1349,
    "sellingPrice": 1249,
    "width": 25.5,
    "height": 12.7,
    "length": 31,
    "weight": 795
  },
  {
    "productName": "Autel EVO Lite",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Autel EVO Lite is a powerful consumer drone built for aerial photography enthusiasts. It delivers stable flight and strong image quality. This drone features intelligent tracking and obstacle avoidance. Its foldable design improves portability.",
    "price": 1049,
    "sellingPrice": 979,
    "width": 21,
    "height": 8.5,
    "length": 17,
    "weight": 820
  },
  {
    "productName": "Parrot Anafi AI",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Parrot Anafi AI is an advanced autonomous drone built for mapping and inspection. It features AI-assisted navigation and secure data transmission. This drone is suitable for professional and enterprise use. Its lightweight design supports extended missions.",
    "price": 4199,
    "sellingPrice": 3999,
    "width": 17.5,
    "height": 6.7,
    "length": 14,
    "weight": 898
  },
  {
    "productName": "Skydio R1",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Skydio R1 is an AI-powered drone capable of fully autonomous flight. It excels at subject tracking and obstacle avoidance. This drone is ideal for dynamic filming scenarios. Its intelligent software minimizes manual piloting.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 22.5,
    "height": 8.5,
    "length": 19,
    "weight": 900
  },
  {
    "productName": "Yuneec Breeze 4K",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.1,
    "description": "The Yuneec Breeze 4K is a compact drone designed for selfie and casual aerial shots. It offers easy controls and decent image quality. This drone is suitable for beginners. Its lightweight design supports quick deployment.",
    "price": 399,
    "sellingPrice": 349,
    "width": 19.6,
    "height": 6.5,
    "length": 19.6,
    "weight": 385
  },
  {
    "productName": "DJI Agras T20",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Agras T20 is an agricultural drone designed for crop spraying and field monitoring. It offers precise navigation and heavy payload capacity. This drone is used in professional farming operations. Its rugged design supports intensive workloads.",
    "price": 15999,
    "sellingPrice": 14999,
    "width": 250,
    "height": 70,
    "length": 250,
    "weight": 21500
  },
  {
    "productName": "DJI Agras T40",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Agras T40 is a heavy-duty agricultural drone built for large-scale farming. It supports high-capacity spraying and intelligent terrain following. This drone improves efficiency in modern agriculture. Its industrial-grade build ensures durability.",
    "price": 19999,
    "sellingPrice": 18999,
    "width": 280,
    "height": 80,
    "length": 280,
    "weight": 25000
  },
  {
    "productName": "BetaFPV Cetus Pro",
    "brandName": "BetaFPV",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The BetaFPV Cetus Pro is an FPV drone kit designed for beginners. It offers stable indoor and outdoor flight performance. This drone is ideal for learning FPV piloting skills. Its lightweight build improves safety during practice.",
    "price": 349,
    "sellingPrice": 319,
    "width": 9.5,
    "height": 4,
    "length": 9.5,
    "weight": 80
  },
  {
    "productName": "DJI Mavic 2 Pro",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The DJI Mavic 2 Pro is a premium consumer drone designed for high-quality aerial photography. It features a large sensor camera and precise flight control. This drone is suitable for professional creators and enthusiasts. Its foldable design improves portability and ease of transport.",
    "price": 1499,
    "sellingPrice": 1399,
    "width": 21.4,
    "height": 9.1,
    "length": 18,
    "weight": 907
  },
  {
    "productName": "DJI Mavic 2 Zoom",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The DJI Mavic 2 Zoom is a versatile drone featuring optical zoom capabilities. It allows pilots to capture dynamic perspectives without changing position. This drone is ideal for creative videography and photography. Its intelligent flight modes support cinematic shots.",
    "price": 1249,
    "sellingPrice": 1149,
    "width": 21.4,
    "height": 9.1,
    "length": 18,
    "weight": 905
  },
  {
    "productName": "Autel EVO Nano",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Autel EVO Nano is an ultra-lightweight drone designed for portability and ease of use. It offers reliable stabilization and good image quality for its size. This drone is ideal for beginners and travelers. Its compact body allows operation in restricted categories.",
    "price": 599,
    "sellingPrice": 549,
    "width": 13.5,
    "height": 5.5,
    "length": 8.5,
    "weight": 249
  },
  {
    "productName": "Parrot Disco FPV",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The Parrot Disco FPV is a fixed-wing drone designed for long-range FPV flights. It delivers extended flight time and smooth gliding performance. This drone is suitable for FPV enthusiasts. Its aerodynamic design supports efficient long-distance travel.",
    "price": 899,
    "sellingPrice": 829,
    "width": 115,
    "height": 8,
    "length": 65,
    "weight": 750
  },
  {
    "productName": "Skydio 2 Enterprise",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The Skydio 2 Enterprise is an autonomous drone designed for industrial and inspection use. It features advanced AI obstacle avoidance and secure data handling. This drone performs well in complex environments. Its rugged build supports professional operations.",
    "price": 2499,
    "sellingPrice": 2399,
    "width": 22,
    "height": 8,
    "length": 18.5,
    "weight": 775
  },
  {
    "productName": "Yuneec Typhoon Q500 4K",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Yuneec Typhoon Q500 4K is a consumer drone designed for stable aerial photography. It delivers smooth video and reliable flight performance. This drone is suitable for beginners and hobbyists. Its included controller offers precise handling.",
    "price": 799,
    "sellingPrice": 729,
    "width": 53,
    "height": 24,
    "length": 53,
    "weight": 1700
  },
  {
    "productName": "PowerVision PowerRay",
    "brandName": "PowerVision",
    "productType": "drone",
    "productImages": [],
    "rating": 4.1,
    "description": "The PowerVision PowerRay is an underwater drone designed for aquatic exploration. It delivers live video streaming and stable underwater navigation. This drone is ideal for inspections and recreational diving. Its tethered design ensures reliable control.",
    "price": 1499,
    "sellingPrice": 1399,
    "width": 46.5,
    "height": 12.6,
    "length": 27.2,
    "weight": 3900
  },
  {
    "productName": "DJI Air 2S Fly More Combo",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The DJI Air 2S Fly More Combo includes additional batteries and accessories for extended flights. It delivers excellent image quality and reliable stabilization. This drone is suitable for advanced creators. Its intelligent tracking modes support cinematic footage.",
    "price": 1299,
    "sellingPrice": 1199,
    "width": 18,
    "height": 7.7,
    "length": 14.2,
    "weight": 595
  },
  {
    "productName": "Holy Stone HS720E",
    "brandName": "Holy Stone",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The Holy Stone HS720E is a consumer drone designed for beginners and hobbyists. It offers GPS-assisted flight and stable video recording. This drone is ideal for learning aerial photography. Its foldable design improves portability.",
    "price": 399,
    "sellingPrice": 349,
    "width": 28,
    "height": 8,
    "length": 24,
    "weight": 495
  },
  {
    "productName": "Autel Dragonfish Standard",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The Autel Dragonfish Standard is a professional fixed-wing drone designed for long-range missions. It offers extended flight time and modular payload support. This drone is suitable for mapping and inspection. Its VTOL design allows vertical takeoff and landing.",
    "price": 21999,
    "sellingPrice": 20999,
    "width": 160,
    "height": 45,
    "length": 160,
    "weight": 7500
  },
  {
    "productName": "DJI Mavic 3 Enterprise",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Mavic 3 Enterprise is a compact professional drone designed for inspection and mapping tasks. It offers high-precision positioning and extended flight time. This drone supports modular payloads for specialized missions. Its foldable design improves portability for field operations.",
    "price": 3899,
    "sellingPrice": 3699,
    "width": 22.1,
    "height": 9.6,
    "length": 18,
    "weight": 915
  },
  {
    "productName": "DJI Mavic 3 Thermal",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Mavic 3 Thermal combines visual and thermal imaging in a portable platform. It is built for search, rescue, and inspection workflows. This drone delivers reliable obstacle avoidance and long endurance. Its thermal sensor enables precise heat detection.",
    "price": 5499,
    "sellingPrice": 5199,
    "width": 22.1,
    "height": 9.6,
    "length": 18,
    "weight": 920
  },
  {
    "productName": "Autel EVO Max 4T",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The Autel EVO Max 4T is a professional drone featuring multi-sensor payloads for enterprise use. It offers strong wind resistance and autonomous navigation. This drone is suitable for public safety and inspection. Its rugged design ensures reliability in harsh conditions.",
    "price": 8999,
    "sellingPrice": 8599,
    "width": 24,
    "height": 10,
    "length": 20,
    "weight": 1150
  },
  {
    "productName": "Autel EVO Max 4N",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The Autel EVO Max 4N is designed for low-light and night operations. It delivers enhanced sensing and stable flight performance. This drone supports advanced mission planning. Its enterprise-grade build targets professional users.",
    "price": 10999,
    "sellingPrice": 10499,
    "width": 24,
    "height": 10,
    "length": 20,
    "weight": 1200
  },
  {
    "productName": "Parrot Anafi Thermal",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Parrot Anafi Thermal is a lightweight drone with integrated thermal imaging. It is suitable for inspection and emergency response. This drone offers quiet operation and easy deployment. Its compact size supports rapid missions.",
    "price": 1899,
    "sellingPrice": 1799,
    "width": 17.5,
    "height": 6.7,
    "length": 14,
    "weight": 320
  },
  {
    "productName": "Skydio X10",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The Skydio X10 is a next-generation autonomous drone built for enterprise operations. It features advanced AI obstacle avoidance and long-range communication. This drone excels in complex environments. Its modular sensors support diverse missions.",
    "price": 14999,
    "sellingPrice": 14499,
    "width": 26,
    "height": 11,
    "length": 22,
    "weight": 1400
  },
  {
    "productName": "DJI Avata 2",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The DJI Avata 2 is a compact FPV drone designed for immersive flying. It delivers improved stabilization and responsive controls. This drone is ideal for cinematic FPV shots. Its ducted design enhances safety during close flights.",
    "price": 999,
    "sellingPrice": 929,
    "width": 18.5,
    "height": 8.5,
    "length": 18.5,
    "weight": 430
  },
  {
    "productName": "DJI Neo",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The DJI Neo is a compact consumer drone focused on ease of use. It provides stable flight and simple controls for beginners. This drone is suitable for casual aerial photography. Its lightweight build improves portability.",
    "price": 299,
    "sellingPrice": 269,
    "width": 12.5,
    "height": 5,
    "length": 7.5,
    "weight": 240
  },
  {
    "productName": "Walkera Voyager 5",
    "brandName": "Walkera",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Walkera Voyager 5 is a professional drone with interchangeable camera systems. It supports long-range flight and stable performance. This drone is suitable for surveying and inspection. Its modular design adds flexibility.",
    "price": 2999,
    "sellingPrice": 2799,
    "width": 55,
    "height": 25,
    "length": 55,
    "weight": 1800
  },
  {
    "productName": "SenseFly eBee X",
    "brandName": "SenseFly",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The SenseFly eBee X is a fixed-wing mapping drone designed for large-area surveys. It offers long endurance and precise data capture. This drone is used in professional mapping workflows. Its lightweight airframe supports efficient flight.",
    "price": 12999,
    "sellingPrice": 12499,
    "width": 116,
    "height": 12,
    "length": 69,
    "weight": 1400
  },
  {
    "productName": "DJI Mavic 3 Cine",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Mavic 3 Cine is a professional aerial platform built for high-end video production. It supports advanced codecs and delivers exceptional dynamic range. This drone is ideal for filmmakers who require reliable performance. Its robust obstacle avoidance enhances flight safety.",
    "price": 4999,
    "sellingPrice": 4799,
    "width": 22.1,
    "height": 9.6,
    "length": 18,
    "weight": 963
  },
  {
    "productName": "DJI Mini 3",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The DJI Mini 3 is a lightweight consumer drone designed for easy operation. It offers stable flight and solid image quality for casual users. This drone is suitable for travel and everyday aerial shots. Its compact design improves portability.",
    "price": 469,
    "sellingPrice": 429,
    "width": 14,
    "height": 6,
    "length": 8.5,
    "weight": 249
  },
  {
    "productName": "Autel EVO II RTK",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The Autel EVO II RTK is a professional drone designed for precision mapping and surveying. It delivers centimeter-level positioning accuracy. This drone is suitable for construction and inspection workflows. Its rugged design supports demanding environments.",
    "price": 7999,
    "sellingPrice": 7599,
    "width": 23,
    "height": 9.5,
    "length": 19,
    "weight": 1191
  },
  {
    "productName": "Parrot Anafi Work",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Parrot Anafi Work is a compact professional drone aimed at inspection tasks. It includes advanced imaging tools and secure data handling. This drone is ideal for maintenance and surveying jobs. Its lightweight design allows rapid deployment.",
    "price": 1799,
    "sellingPrice": 1699,
    "width": 17.5,
    "height": 6.7,
    "length": 14,
    "weight": 320
  },
  {
    "productName": "Skydio X2D",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The Skydio X2D is an autonomous drone designed for defense and enterprise missions. It features AI-powered navigation and secure communications. This drone excels in complex environments. Its durable construction ensures mission reliability.",
    "price": 15999,
    "sellingPrice": 15499,
    "width": 26,
    "height": 11,
    "length": 22,
    "weight": 1450
  },
  {
    "productName": "Yuneec Typhoon H3",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Yuneec Typhoon H3 is a professional hexacopter featuring advanced obstacle avoidance. It delivers stable flight and high-quality video capture. This drone is suitable for commercial videography. Its six-rotor design adds redundancy.",
    "price": 1999,
    "sellingPrice": 1849,
    "width": 52,
    "height": 22,
    "length": 52,
    "weight": 1985
  },
  {
    "productName": "DJI Phantom 4 RTK",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The DJI Phantom 4 RTK is a precision mapping drone built for surveying professionals. It offers real-time kinematic positioning for accurate data capture. This drone is widely used in construction and mapping. Its solid airframe ensures stability.",
    "price": 6499,
    "sellingPrice": 6199,
    "width": 35,
    "height": 19,
    "length": 35,
    "weight": 1391
  },
  {
    "productName": "Holy Stone HS175D",
    "brandName": "Holy Stone",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The Holy Stone HS175D is a GPS-enabled consumer drone designed for beginners. It offers stable hovering and simple controls. This drone is ideal for learning aerial photography. Its foldable body improves portability.",
    "price": 299,
    "sellingPrice": 269,
    "width": 27,
    "height": 8,
    "length": 22,
    "weight": 260
  },
  {
    "productName": "Walkera Vitus",
    "brandName": "Walkera",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Walkera Vitus is a compact foldable drone with professional-grade camera features. It delivers stable flight and good image quality. This drone is suitable for enthusiasts and creators. Its lightweight design improves travel usability.",
    "price": 899,
    "sellingPrice": 829,
    "width": 19,
    "height": 7,
    "length": 15,
    "weight": 478
  },
  {
    "productName": "AgEagle eBee TAC",
    "brandName": "AgEagle",
    "productType": "drone",
    "productImages": [],
    "rating": 4.7,
    "description": "The AgEagle eBee TAC is a fixed-wing drone designed for tactical and mapping operations. It offers long flight endurance and lightweight construction. This drone is suitable for large-area surveys. Its efficient design supports extended missions.",
    "price": 14999,
    "sellingPrice": 14499,
    "width": 110,
    "height": 12,
    "length": 65,
    "weight": 1400
  },
  {
    "productName": "DJI Mavic SE",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The DJI Mavic SE is a compact consumer drone aimed at casual pilots. It offers stable flight, basic intelligent modes, and reliable image quality. This drone is suitable for learning aerial photography. Its foldable body improves portability.",
    "price": 329,
    "sellingPrice": 299,
    "width": 13.8,
    "height": 5.8,
    "length": 8.1,
    "weight": 249
  },
  {
    "productName": "DJI Air 1",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The DJI Air 1 is a lightweight foldable drone designed for enthusiasts. It delivers stable flight performance and clear aerial footage. This drone is ideal for travel and everyday shooting. Its compact size enhances mobility.",
    "price": 699,
    "sellingPrice": 649,
    "width": 16.8,
    "height": 6.6,
    "length": 13.2,
    "weight": 430
  },
  {
    "productName": "Autel EVO Lite Enterprise",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Autel EVO Lite Enterprise is designed for inspection and commercial tasks. It offers reliable obstacle avoidance and long flight endurance. This drone supports professional workflows. Its foldable design ensures easy transport.",
    "price": 2199,
    "sellingPrice": 2049,
    "width": 21,
    "height": 8.5,
    "length": 17,
    "weight": 850
  },
  {
    "productName": "Parrot Bebop Pro Thermal",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Parrot Bebop Pro Thermal is a lightweight drone featuring thermal imaging. It is designed for inspection and emergency response. This drone offers easy deployment and stable flight. Its compact design supports field operations.",
    "price": 3299,
    "sellingPrice": 3099,
    "width": 38.2,
    "height": 11.8,
    "length": 32.8,
    "weight": 600
  },
  {
    "productName": "Skydio X2E",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The Skydio X2E is an enterprise autonomous drone with advanced AI navigation. It excels in complex environments and GPS-denied areas. This drone is ideal for inspection and public safety. Its rugged design ensures mission reliability.",
    "price": 12499,
    "sellingPrice": 11999,
    "width": 26,
    "height": 11,
    "length": 22,
    "weight": 1350
  },
  {
    "productName": "Yuneec H520 RTK",
    "brandName": "Yuneec",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Yuneec H520 RTK is a professional hexacopter designed for precision mapping. It provides stable flight and centimeter-level positioning. This drone is suitable for surveying and inspection. Its six-rotor design enhances redundancy.",
    "price": 3299,
    "sellingPrice": 3099,
    "width": 52,
    "height": 22,
    "length": 52,
    "weight": 1985
  },
  {
    "productName": "Holy Stone HS720G",
    "brandName": "Holy Stone",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Holy Stone HS720G is a GPS-assisted drone designed for beginners and hobbyists. It offers stable hovering and simple intelligent modes. This drone is ideal for learning aerial photography. Its foldable body improves portability.",
    "price": 329,
    "sellingPrice": 299,
    "width": 28,
    "height": 8,
    "length": 24,
    "weight": 460
  },
  {
    "productName": "Walkera F210",
    "brandName": "Walkera",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Walkera F210 is an FPV racing drone built for speed and durability. It offers responsive controls and strong impact resistance. This drone is suitable for FPV enthusiasts. Its carbon fiber frame improves resilience.",
    "price": 799,
    "sellingPrice": 739,
    "width": 21,
    "height": 8,
    "length": 21,
    "weight": 370
  },
  {
    "productName": "PowerVision PowerEgg X Explorer",
    "brandName": "PowerVision",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The PowerVision PowerEgg X Explorer is a weather-resistant drone designed for versatile filming. It performs well in rain and snow conditions. This drone is suitable for creative outdoor content. Its modular design adds flexibility.",
    "price": 999,
    "sellingPrice": 929,
    "width": 22,
    "height": 9,
    "length": 22,
    "weight": 860
  },
  {
    "productName": "AgEagle eBee Geo",
    "brandName": "AgEagle",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The AgEagle eBee Geo is a fixed-wing mapping drone designed for large-area surveys. It offers efficient flight and high-precision data capture. This drone is suitable for professional mapping workflows. Its lightweight airframe supports extended missions.",
    "price": 9999,
    "sellingPrice": 9599,
    "width": 110,
    "height": 12,
    "length": 65,
    "weight": 1400
  },
  {
    "productName": "DJI Inspire 3",
    "brandName": "DJI",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The DJI Inspire 3 is a flagship cinema drone built for professional filmmakers. It supports advanced camera systems and precise flight control. The drone is designed for complex aerial cinematography workflows. Its robust construction ensures stability and reliability in demanding shoots.",
    "price": 16499,
    "sellingPrice": 15999,
    "width": 60,
    "height": 19,
    "length": 60,
    "weight": 3995
  },
  {
    "productName": "Autel EVO Nano Plus",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Autel EVO Nano Plus is a compact drone offering advanced imaging in a small form factor. It provides strong obstacle avoidance and reliable flight performance. This drone is suitable for travelers and enthusiasts. Its lightweight build supports portability.",
    "price": 649,
    "sellingPrice": 599,
    "width": 14.2,
    "height": 5.5,
    "length": 9,
    "weight": 249
  },
  {
    "productName": "Autel EVO Lite Plus",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Autel EVO Lite Plus is designed for high-quality aerial photography. It delivers long flight time and strong low-light performance. The drone is suitable for content creators and professionals. Its foldable design improves portability.",
    "price": 1149,
    "sellingPrice": 1049,
    "width": 21,
    "height": 8.5,
    "length": 17,
    "weight": 835
  },
  {
    "productName": "Skydio S2+",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.8,
    "description": "The Skydio S2+ is an autonomous drone built with advanced AI navigation. It excels at obstacle avoidance and tracking subjects. This drone is suitable for inspection and dynamic filming. Its compact design improves usability in tight spaces.",
    "price": 2999,
    "sellingPrice": 2799,
    "width": 23,
    "height": 10,
    "length": 23,
    "weight": 800
  },
  {
    "productName": "Hubsan Zino Mini Pro",
    "brandName": "Hubsan",
    "productType": "drone",
    "productImages": [],
    "rating": 4.3,
    "description": "The Hubsan Zino Mini Pro is a lightweight drone designed for travel and portability. It offers advanced flight modes and good image quality. This drone is suitable for enthusiasts. Its foldable design improves convenience.",
    "price": 479,
    "sellingPrice": 439,
    "width": 13.7,
    "height": 6.1,
    "length": 8.5,
    "weight": 249
  },
  {
    "productName": "Autel Dragonfish Pro",
    "brandName": "Autel Robotics",
    "productType": "drone",
    "productImages": [],
    "rating": 4.6,
    "description": "The Autel Dragonfish Pro is a professional VTOL drone designed for large-scale mapping and inspection. It offers long endurance and precise positioning. This drone is used in industrial and surveying applications. Its hybrid design allows vertical takeoff and efficient forward flight.",
    "price": 17999,
    "sellingPrice": 17299,
    "width": 150,
    "height": 30,
    "length": 120,
    "weight": 7300
  },
  {
    "productName": "Parrot Disco Pro AG",
    "brandName": "Parrot",
    "productType": "drone",
    "productImages": [],
    "rating": 4.5,
    "description": "The Parrot Disco Pro AG is a fixed-wing drone designed for agricultural mapping. It provides long flight times and efficient area coverage. This drone is ideal for crop monitoring and analysis. Its lightweight construction improves endurance.",
    "price": 4999,
    "sellingPrice": 4699,
    "width": 115,
    "height": 12,
    "length": 58,
    "weight": 750
  },
  {
    "productName": "Skydio 2+ Pro Kit",
    "brandName": "Skydio",
    "productType": "drone",
    "productImages": [],
    "rating": 4.9,
    "description": "The Skydio 2+ Pro Kit is an autonomous drone built for inspection and enterprise workflows. It features advanced AI-based obstacle avoidance. This drone excels in complex environments. Its compact design supports rapid deployment.",
    "price": 3699,
    "sellingPrice": 3499,
    "width": 23,
    "height": 10,
    "length": 23,
    "weight": 800
  },
  {
    "productName": "Hubsan Zino Pro Plus",
    "brandName": "Hubsan",
    "productType": "drone",
    "productImages": [],
    "rating": 4.4,
    "description": "The Hubsan Zino Pro Plus is a consumer drone with extended flight time and strong imaging performance. It supports intelligent flight modes and GPS stabilization. This drone is suitable for enthusiasts. Its foldable design improves portability.",
    "price": 699,
    "sellingPrice": 649,
    "width": 20,
    "height": 8,
    "length": 18,
    "weight": 700
  },
  {
    "productName": "BetaFPV Aquila16",
    "brandName": "BetaFPV",
    "productType": "drone",
    "productImages": [],
    "rating": 4.2,
    "description": "The BetaFPV Aquila16 is a beginner-friendly FPV drone designed for indoor flying. It offers stable flight modes and durable construction. This drone is ideal for learning FPV skills. Its lightweight frame improves safety and control.",
    "price": 249,
    "sellingPrice": 229,
    "width": 10.5,
    "height": 5,
    "length": 10.5,
    "weight": 120
  }
]