[
    {
    "productName": "LG InstaView Door-in-Door Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The LG InstaView Door-in-Door Refrigerator is designed to provide quick access to frequently used items while maintaining energy efficiency. Its glass panel lights up with a simple knock, reducing cold air loss. The refrigerator offers spacious storage and advanced cooling technology. It is well suited for modern kitchens and large households.",
    "price": 2999,
    "sellingPrice": 2699,
    "width": 91.2,
    "height": 179.0,
    "length": 73.5,
    "weight": 130000
  },
  {
    "productName": "Samsung Family Hub French Door Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Samsung Family Hub Refrigerator combines smart technology with premium storage capacity. It features a built-in touchscreen for managing groceries, calendars, and entertainment. The advanced cooling system keeps food fresh for longer periods. This refrigerator is ideal for tech-oriented households.",
    "price": 3499,
    "sellingPrice": 3199,
    "width": 90.8,
    "height": 177.8,
    "length": 74.0,
    "weight": 135000
  },
  {
    "productName": "Bosch Serie 6 Bottom Freezer Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Bosch Serie 6 Bottom Freezer Refrigerator offers efficient cooling with a sleek European design. Its multi-airflow system ensures consistent temperatures throughout the interior. The freezer compartment provides easy access and ample space. This model is suitable for everyday household use.",
    "price": 1899,
    "sellingPrice": 1699,
    "width": 70.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 85000
  },
  {
    "productName": "Whirlpool Double Door Frost Free Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Whirlpool Double Door Frost Free Refrigerator is built for reliable daily performance. It features adaptive cooling technology that responds to usage patterns. The interior layout provides organized storage for fresh and frozen food. This refrigerator balances durability and affordability.",
    "price": 1299,
    "sellingPrice": 1149,
    "width": 67.0,
    "height": 170.0,
    "length": 70.0,
    "weight": 72000
  },
  {
    "productName": "Siemens iQ500 Built-In Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Siemens iQ500 Built-In Refrigerator is designed for seamless kitchen integration. It delivers precise temperature control and quiet operation. The interior is optimized for flexible storage options. This model is ideal for premium kitchen installations.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 56.0,
    "height": 177.5,
    "length": 55.0,
    "weight": 78000
  },
  {
    "productName": "Haier Side-by-Side Refrigerator",
    "brandName": "Haier",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Haier Side-by-Side Refrigerator provides large storage capacity for busy households. It offers efficient cooling and easy access to both fridge and freezer sections. The design focuses on practicality and durability. This refrigerator is suitable for families with higher storage needs.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 90.0,
    "height": 176.0,
    "length": 72.0,
    "weight": 120000
  },
  {
    "productName": "Electrolux UltimateTaste Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Electrolux UltimateTaste Refrigerator is designed to preserve food freshness with advanced humidity control. It offers a refined interior layout and energy-efficient operation. The cooling system minimizes temperature fluctuations. This model fits well in modern households.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 69.5,
    "height": 187.0,
    "length": 68.0,
    "weight": 90000
  },
  {
    "productName": "Beko NeoFrost MultiDoor Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Beko NeoFrost MultiDoor Refrigerator uses dual cooling systems to prevent odor mixing. It offers spacious compartments and flexible shelving. The appliance delivers efficient performance with low energy consumption. It is suitable for families seeking practicality and value.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 83.0,
    "height": 190.0,
    "length": 74.0,
    "weight": 110000
  },
  {
    "productName": "Miele PerfectFresh Pro Refrigerator",
    "brandName": "Miele",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.8,
    "description": "The Miele PerfectFresh Pro Refrigerator is engineered for long-lasting food preservation. It maintains optimal humidity and temperature levels for fresh produce. The premium build ensures durability and quiet operation. This refrigerator targets high-end kitchen environments.",
    "price": 4299,
    "sellingPrice": 3999,
    "width": 75.6,
    "height": 185.0,
    "length": 60.8,
    "weight": 115000
  },
  {
    "productName": "Hisense French Door Refrigerator",
    "brandName": "Hisense",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Hisense French Door Refrigerator offers generous storage capacity with efficient cooling performance. It features adjustable shelves and modern temperature controls. The design focuses on usability and affordability. This model is ideal for medium to large households.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 79.0,
    "height": 178.5,
    "length": 73.0,
    "weight": 108000
  },
  {
    "productName": "LG Smart Inverter Top Freezer Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The LG Smart Inverter Top Freezer Refrigerator is designed for energy efficiency and reliable cooling. Its inverter compressor adapts to usage patterns to reduce power consumption. The interior offers practical shelving for everyday storage. This model is suitable for small to medium households.",
    "price": 999,
    "sellingPrice": 899,
    "width": 60.0,
    "height": 172.0,
    "length": 68.0,
    "weight": 65000
  },
  {
    "productName": "Samsung Bespoke 4-Door Flex Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.8,
    "description": "The Samsung Bespoke 4-Door Flex Refrigerator offers customizable panels and flexible storage zones. It features precise temperature control for different food types. The design blends premium aesthetics with advanced cooling. This refrigerator is ideal for modern, design-focused kitchens.",
    "price": 3799,
    "sellingPrice": 3499,
    "width": 90.5,
    "height": 185.0,
    "length": 73.0,
    "weight": 140000
  },
  {
    "productName": "Bosch Serie 4 Freestanding Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Bosch Serie 4 Freestanding Refrigerator provides reliable cooling with a simple, clean design. Its multi-airflow system helps maintain consistent temperatures. The appliance is easy to integrate into most kitchens. It is well suited for everyday family use.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 70.0,
    "height": 186.0,
    "length": 66.0,
    "weight": 80000
  },
  {
    "productName": "Whirlpool IntelliFresh Triple Door Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Whirlpool IntelliFresh Triple Door Refrigerator is designed to keep food fresh for extended periods. It uses intelligent sensors to regulate cooling levels. The triple-door layout improves organization and access. This model is ideal for busy households.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 68.0,
    "height": 180.0,
    "length": 72.0,
    "weight": 95000
  },
  {
    "productName": "AEG CustomFlex Built-In Refrigerator",
    "brandName": "AEG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The AEG CustomFlex Built-In Refrigerator offers modular door storage for maximum flexibility. It provides precise temperature management and quiet operation. The integrated design fits seamlessly into modern kitchens. This model is suitable for premium installations.",
    "price": 2599,
    "sellingPrice": 2399,
    "width": 56.0,
    "height": 177.2,
    "length": 55.0,
    "weight": 78000
  },
  {
    "productName": "Sharp Plasmacluster Side-by-Side Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Sharp Plasmacluster Side-by-Side Refrigerator uses air purification technology to reduce odors. It offers spacious compartments for fresh and frozen food. The appliance is designed for durability and efficiency. This refrigerator suits large households.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 91.0,
    "height": 178.0,
    "length": 72.0,
    "weight": 125000
  },
  {
    "productName": "Indesit Low Frost Refrigerator",
    "brandName": "Indesit",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.2,
    "description": "The Indesit Low Frost Refrigerator is designed for simple maintenance and consistent cooling. It reduces ice buildup while maintaining storage efficiency. The interior layout supports everyday grocery storage. This model offers good value for budget-conscious buyers.",
    "price": 899,
    "sellingPrice": 799,
    "width": 59.5,
    "height": 171.0,
    "length": 65.0,
    "weight": 62000
  },
  {
    "productName": "Gorenje Retro Collection Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Gorenje Retro Collection Refrigerator combines vintage design with modern cooling technology. It offers efficient performance and organized storage. The appliance adds a distinctive aesthetic to kitchens. This model suits style-focused households.",
    "price": 1899,
    "sellingPrice": 1699,
    "width": 60.0,
    "height": 194.0,
    "length": 66.0,
    "weight": 88000
  },
  {
    "productName": "Candy Smart Pro Refrigerator",
    "brandName": "Candy",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.1,
    "description": "The Candy Smart Pro Refrigerator offers connected features for remote temperature monitoring. It delivers consistent cooling with a compact footprint. The interior is designed for flexible storage. This model is suitable for apartments and smaller kitchens.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 60.0,
    "height": 185.0,
    "length": 65.0,
    "weight": 70000
  },
  {
    "productName": "Liebherr BioFresh Professional Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.9,
    "description": "The Liebherr BioFresh Professional Refrigerator is engineered for precise food preservation. It maintains optimal humidity and temperature for fresh ingredients. The premium construction ensures durability and quiet operation. This refrigerator is aimed at high-end kitchens and professional use.",
    "price": 4599,
    "sellingPrice": 4299,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 118000
  },
  {
    "productName": "Samsung Twin Cooling Plus Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Samsung Twin Cooling Plus Refrigerator uses independent cooling systems for the fridge and freezer. This helps maintain optimal humidity and prevents odor transfer between compartments. The refrigerator offers efficient performance and flexible storage options. It is well suited for everyday family use.",
    "price": 1599,
    "sellingPrice": 1449,
    "width": 70.0,
    "height": 178.0,
    "length": 72.0,
    "weight": 90000
  },
  {
    "productName": "LG Linear Cooling French Door Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The LG Linear Cooling French Door Refrigerator minimizes temperature fluctuations to keep food fresh longer. Its spacious interior is designed for organized storage and easy access. The linear compressor ensures quiet and energy-efficient operation. This model fits modern kitchens and busy households.",
    "price": 2899,
    "sellingPrice": 2599,
    "width": 83.5,
    "height": 178.0,
    "length": 73.0,
    "weight": 128000
  },
  {
    "productName": "Bosch VitaFresh Plus Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Bosch VitaFresh Plus Refrigerator is designed to extend the freshness of fruits and vegetables. It features precise temperature and humidity controls. The appliance delivers consistent cooling throughout the interior. This refrigerator is ideal for health-conscious households.",
    "price": 2399,
    "sellingPrice": 2199,
    "width": 70.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 92000
  },
  {
    "productName": "Whirlpool W Collection Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Whirlpool W Collection Refrigerator combines premium design with reliable cooling technology. It offers flexible shelving and spacious compartments. The appliance is built for durability and long-term use. This model suits families seeking both style and performance.",
    "price": 2699,
    "sellingPrice": 2449,
    "width": 71.0,
    "height": 190.0,
    "length": 70.0,
    "weight": 105000
  },
  {
    "productName": "Siemens iQ700 French Door Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Siemens iQ700 French Door Refrigerator offers advanced cooling and a premium finish. It provides consistent temperature control and smart interior lighting. The refrigerator is designed for energy efficiency and quiet operation. This model is suitable for high-end kitchen environments.",
    "price": 3899,
    "sellingPrice": 3599,
    "width": 90.0,
    "height": 183.0,
    "length": 73.0,
    "weight": 140000
  },
  {
    "productName": "Beko HarvestFresh Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Beko HarvestFresh Refrigerator uses light technology to preserve vitamins in fruits and vegetables. It delivers reliable cooling with low energy consumption. The interior layout supports flexible food storage. This model offers good value for everyday use.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 69.0,
    "height": 186.0,
    "length": 70.0,
    "weight": 88000
  },
  {
    "productName": "Electrolux NoFrost Multi-Door Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Electrolux NoFrost Multi-Door Refrigerator prevents ice buildup and ensures even cooling. It offers spacious compartments and adjustable shelving. The appliance is designed for efficiency and convenience. This refrigerator is ideal for larger households.",
    "price": 2499,
    "sellingPrice": 2299,
    "width": 83.0,
    "height": 181.0,
    "length": 75.0,
    "weight": 120000
  },
  {
    "productName": "Hisense PureFlat Smart Refrigerator",
    "brandName": "Hisense",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.2,
    "description": "The Hisense PureFlat Smart Refrigerator combines a slim design with smart connectivity features. It provides consistent cooling and easy access to stored items. The appliance focuses on modern usability and efficiency. This model fits well in contemporary kitchens.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 70.0,
    "height": 179.0,
    "length": 68.0,
    "weight": 95000
  },
  {
    "productName": "Zanussi SpaceFlex Refrigerator",
    "brandName": "Zanussi",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.1,
    "description": "The Zanussi SpaceFlex Refrigerator is designed for flexible storage and easy organization. It features adjustable compartments and efficient cooling. The appliance is simple to operate and maintain. This model is suitable for small to medium households.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 60.0,
    "height": 185.0,
    "length": 65.0,
    "weight": 70000
  },
  {
    "productName": "Liebherr Prime BioFresh Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.8,
    "description": "The Liebherr Prime BioFresh Refrigerator offers precise temperature control for premium food preservation. It maintains ideal conditions for meat, dairy, and produce. The appliance is built with high-quality materials for long-term reliability. This refrigerator is aimed at premium kitchen installations.",
    "price": 3999,
    "sellingPrice": 3699,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 115000
  },
  {
    "productName": "LG NatureFRESH Side-by-Side Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The LG NatureFRESH Side-by-Side Refrigerator is designed to maintain optimal freshness through consistent temperature control. It provides generous storage space for both fresh and frozen foods. The cooling system minimizes temperature fluctuations to extend food life. This model is suitable for larger households.",
    "price": 2299,
    "sellingPrice": 2099,
    "width": 91.0,
    "height": 178.0,
    "length": 72.0,
    "weight": 125000
  },
  {
    "productName": "Samsung SpaceMax Bottom Freezer Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Samsung SpaceMax Bottom Freezer Refrigerator maximizes interior capacity without increasing external dimensions. It features efficient insulation and uniform cooling. The freezer compartment allows easy access to frozen goods. This refrigerator fits well in modern kitchens.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 70.0,
    "height": 185.0,
    "length": 68.0,
    "weight": 90000
  },
  {
    "productName": "Bosch Serie 8 French Door Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Bosch Serie 8 French Door Refrigerator delivers premium cooling performance with a refined design. It maintains stable humidity levels to preserve food freshness. The spacious interior allows flexible organization. This model is ideal for high-end kitchen setups.",
    "price": 3699,
    "sellingPrice": 3399,
    "width": 90.5,
    "height": 183.0,
    "length": 73.0,
    "weight": 138000
  },
  {
    "productName": "Whirlpool FreshFlow Multi-Door Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Whirlpool FreshFlow Multi-Door Refrigerator ensures even cooling across all compartments. It features adaptive airflow to maintain consistent temperatures. The layout provides organized storage for daily groceries. This appliance is designed for convenience and durability.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 83.0,
    "height": 180.0,
    "length": 74.0,
    "weight": 110000
  },
  {
    "productName": "Siemens iQ300 Bottom Freezer Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Siemens iQ300 Bottom Freezer Refrigerator offers efficient cooling with a clean, minimalist design. It uses intelligent sensors to regulate internal temperature. The freezer drawer provides easy access and organization. This model is suitable for everyday household use.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 70.0,
    "height": 186.0,
    "length": 66.0,
    "weight": 85000
  },
  {
    "productName": "Beko ProSmart Inverter Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Beko ProSmart Inverter Refrigerator delivers quiet and energy-efficient operation. It maintains consistent cooling for improved food preservation. The interior layout supports flexible storage options. This refrigerator offers solid performance at a competitive price.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 69.0,
    "height": 186.0,
    "length": 70.0,
    "weight": 87000
  },
  {
    "productName": "Electrolux UltraFlex Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Electrolux UltraFlex Refrigerator is designed for adaptable storage and efficient cooling. It offers adjustable shelving and consistent airflow. The appliance operates quietly and efficiently. This model suits contemporary kitchen environments.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 70.0,
    "height": 187.0,
    "length": 68.0,
    "weight": 92000
  },
  {
    "productName": "Sharp J-Tech Inverter Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sharp J-Tech Inverter Refrigerator uses precise inverter control to reduce energy consumption. It maintains stable cooling across compartments. The design focuses on long-term reliability. This refrigerator is suitable for medium-sized households.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 68.5,
    "height": 181.0,
    "length": 70.0,
    "weight": 90000
  },
  {
    "productName": "Gorenje IonAir MultiDoor Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Gorenje IonAir MultiDoor Refrigerator uses ionization technology to maintain food freshness. It offers spacious compartments and flexible organization. The appliance delivers efficient cooling with modern aesthetics. This model fits well in family kitchens.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 83.0,
    "height": 190.0,
    "length": 74.0,
    "weight": 115000
  },
  {
    "productName": "Liebherr Pure NoFrost Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.8,
    "description": "The Liebherr Pure NoFrost Refrigerator prevents ice buildup while delivering precise temperature control. It is engineered for reliable long-term food preservation. The high-quality construction ensures durability and quiet operation. This refrigerator is suited for premium kitchens.",
    "price": 3499,
    "sellingPrice": 3199,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 112000
  },
   {
    "productName": "LG DoorCooling+ Bottom Freezer Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The LG DoorCooling+ Bottom Freezer Refrigerator delivers faster and more even cooling across the interior. Cold air is distributed efficiently to keep food fresh longer. The bottom freezer layout provides convenient access to daily items. This model is well suited for modern households.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 70.0,
    "height": 186.0,
    "length": 68.0,
    "weight": 88000
  },
  {
    "productName": "Samsung Digital Inverter Side-by-Side Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Samsung Digital Inverter Side-by-Side Refrigerator provides consistent cooling with reduced energy consumption. Its digital inverter compressor adjusts performance based on demand. The spacious layout offers easy organization of food items. This refrigerator is ideal for larger families.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 91.0,
    "height": 178.0,
    "length": 72.0,
    "weight": 125000
  },
  {
    "productName": "Bosch KGN36VWEA NoFrost Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Bosch KGN36VWEA NoFrost Refrigerator eliminates the need for manual defrosting. It ensures even airflow throughout the fridge and freezer. The interior design supports flexible storage solutions. This model is practical and easy to maintain.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 60.0,
    "height": 186.0,
    "length": 66.0,
    "weight": 83000
  },
  {
    "productName": "Whirlpool Total NoFrost Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Whirlpool Total NoFrost Refrigerator prevents ice buildup while maintaining consistent cooling. It offers spacious compartments and adjustable shelving. The appliance is designed for convenience and reliability. This model suits everyday family needs.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 70.0,
    "height": 187.0,
    "length": 72.0,
    "weight": 98000
  },
  {
    "productName": "Siemens iQ500 MultiAirflow Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Siemens iQ500 MultiAirflow Refrigerator ensures uniform cooling throughout the interior. Its intelligent airflow system keeps food fresh for longer. The appliance operates quietly and efficiently. This refrigerator is suitable for contemporary kitchens.",
    "price": 2299,
    "sellingPrice": 2099,
    "width": 70.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 94000
  },
  {
    "productName": "Beko AeroFlow Frost Free Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Beko AeroFlow Frost Free Refrigerator delivers gentle air circulation to preserve food quality. It reduces temperature fluctuations and prevents drying. The interior layout is designed for flexible storage. This model offers strong value and efficiency.",
    "price": 1399,
    "sellingPrice": 1249,
    "width": 69.0,
    "height": 186.0,
    "length": 70.0,
    "weight": 86000
  },
  {
    "productName": "Electrolux GreenZone Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Electrolux GreenZone Refrigerator is designed to preserve fruits and vegetables with controlled humidity. It offers stable cooling and efficient airflow. The appliance features a refined interior layout. This refrigerator fits modern households seeking freshness and performance.",
    "price": 2399,
    "sellingPrice": 2199,
    "width": 70.0,
    "height": 188.0,
    "length": 68.0,
    "weight": 96000
  },
  {
    "productName": "Sharp MegaFreezer Bottom Mount Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.2,
    "description": "The Sharp MegaFreezer Bottom Mount Refrigerator offers a large freezer compartment for bulk storage. It provides consistent cooling with energy-efficient performance. The appliance is built for everyday practicality. This model suits families with higher frozen food needs.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 68.5,
    "height": 182.0,
    "length": 70.0,
    "weight": 90000
  },
  {
    "productName": "Gorenje AdaptTech Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Gorenje AdaptTech Refrigerator learns usage patterns to optimize cooling efficiency. It reduces temperature spikes caused by frequent door openings. The interior provides flexible storage options. This refrigerator is designed for consistent performance and convenience.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 60.0,
    "height": 185.0,
    "length": 66.0,
    "weight": 85000
  },
  {
    "productName": "Liebherr BluPerformance Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.9,
    "description": "The Liebherr BluPerformance Refrigerator integrates advanced cooling technology into the base of the unit. This allows greater interior capacity and improved energy efficiency. The appliance delivers precise temperature control and quiet operation. It is designed for premium kitchen environments.",
    "price": 3899,
    "sellingPrice": 3599,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 118000
  },
  {
    "productName": "LG ThinQ Smart French Door Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The LG ThinQ Smart French Door Refrigerator integrates smart connectivity for remote monitoring and control. It delivers consistent cooling and efficient energy usage. The spacious interior is designed for flexible food organization. This refrigerator is ideal for connected smart homes.",
    "price": 3099,
    "sellingPrice": 2799,
    "width": 83.5,
    "height": 178.0,
    "length": 74.0,
    "weight": 130000
  },
  {
    "productName": "Samsung EcoBubble Multi-Door Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Samsung EcoBubble Multi-Door Refrigerator is built for efficient cooling with minimal energy consumption. It maintains stable temperatures across all compartments. The multi-door layout improves organization and accessibility. This model suits modern family kitchens.",
    "price": 2599,
    "sellingPrice": 2349,
    "width": 83.0,
    "height": 182.0,
    "length": 73.0,
    "weight": 120000
  },
  {
    "productName": "Bosch VitaFresh XXL Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Bosch VitaFresh XXL Refrigerator offers extended storage space with precise freshness control. It is designed to preserve fruits, vegetables, and meats for longer periods. The interior layout allows flexible organization. This refrigerator fits well in larger households.",
    "price": 2899,
    "sellingPrice": 2599,
    "width": 75.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 102000
  },
  {
    "productName": "Whirlpool SupremeCool Inverter Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Whirlpool SupremeCool Inverter Refrigerator provides consistent cooling with reduced power consumption. Its inverter compressor adapts to usage demands. The refrigerator is designed for reliable everyday performance. This model balances efficiency and affordability.",
    "price": 1399,
    "sellingPrice": 1249,
    "width": 68.0,
    "height": 175.0,
    "length": 70.0,
    "weight": 78000
  },
  {
    "productName": "Siemens HyperFresh Premium Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Siemens HyperFresh Premium Refrigerator maintains ideal humidity levels for fresh produce. It delivers even airflow and stable temperatures. The elegant design complements high-end kitchens. This model is built for long-term reliability and performance.",
    "price": 3399,
    "sellingPrice": 3099,
    "width": 70.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 110000
  },
  {
    "productName": "Beko NeoFrost Dual Cooling Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Beko NeoFrost Dual Cooling Refrigerator uses separate cooling systems to prevent odor transfer. It keeps food fresher for longer periods. The interior layout is practical and spacious. This refrigerator is suitable for medium to large families.",
    "price": 1799,
    "sellingPrice": 1599,
    "width": 69.0,
    "height": 186.0,
    "length": 70.0,
    "weight": 92000
  },
  {
    "productName": "Electrolux TasteLock Plus Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Electrolux TasteLock Plus Refrigerator is designed to preserve food freshness with advanced humidity control. It offers stable cooling and flexible shelving. The appliance operates quietly and efficiently. This model is ideal for modern kitchens.",
    "price": 2499,
    "sellingPrice": 2249,
    "width": 70.0,
    "height": 188.0,
    "length": 68.0,
    "weight": 98000
  },
  {
    "productName": "Sharp Plasmacluster Premium Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sharp Plasmacluster Premium Refrigerator uses air purification technology to maintain a clean interior environment. It reduces odors and bacteria growth. The appliance delivers reliable cooling performance. This model suits households seeking hygiene-focused appliances.",
    "price": 1899,
    "sellingPrice": 1699,
    "width": 68.5,
    "height": 180.0,
    "length": 70.0,
    "weight": 94000
  },
  {
    "productName": "Gorenje Advanced NoFrost Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Gorenje Advanced NoFrost Refrigerator eliminates ice buildup while maintaining consistent cooling. It offers spacious compartments and adjustable shelving. The appliance focuses on efficiency and ease of use. This refrigerator is suitable for family kitchens.",
    "price": 1899,
    "sellingPrice": 1699,
    "width": 60.0,
    "height": 194.0,
    "length": 66.0,
    "weight": 90000
  },
  {
    "productName": "Liebherr Prime NoFrost XL Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.9,
    "description": "The Liebherr Prime NoFrost XL Refrigerator offers precision cooling with an extended interior capacity. It maintains ideal storage conditions for all food types. The premium build ensures quiet and durable operation. This refrigerator is designed for luxury kitchen environments.",
    "price": 4199,
    "sellingPrice": 3899,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 120000
  },
  {
    "productName": "LG InstaView Craft Ice Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The LG InstaView Craft Ice Refrigerator features a transparent glass panel for quick interior access. It produces slow-melting craft ice designed for premium beverages. The refrigerator delivers consistent cooling and ample storage. This model is ideal for modern, entertainment-focused kitchens.",
    "price": 3799,
    "sellingPrice": 3499,
    "width": 91.4,
    "height": 179.0,
    "length": 73.5,
    "weight": 138000
  },
  {
    "productName": "Samsung FlexZone Quad Door Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Samsung FlexZone Quad Door Refrigerator offers customizable temperature zones for different food types. It allows flexible switching between fridge and freezer modes. The interior layout maximizes organization and accessibility. This refrigerator suits large families with diverse storage needs.",
    "price": 3599,
    "sellingPrice": 3299,
    "width": 90.8,
    "height": 182.0,
    "length": 74.0,
    "weight": 142000
  },
  {
    "productName": "Bosch Serie 2 LowFrost Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.2,
    "description": "The Bosch Serie 2 LowFrost Refrigerator reduces ice buildup and simplifies maintenance. It delivers stable cooling performance with efficient energy usage. The interior is designed for practical everyday storage. This model is suitable for smaller households.",
    "price": 1199,
    "sellingPrice": 1049,
    "width": 60.0,
    "height": 176.0,
    "length": 66.0,
    "weight": 72000
  },
  {
    "productName": "Whirlpool Zen Inverter Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Whirlpool Zen Inverter Refrigerator delivers quiet operation and efficient cooling. Its inverter technology adapts to usage patterns for energy savings. The interior layout supports flexible storage options. This refrigerator balances performance and affordability.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 68.0,
    "height": 178.0,
    "length": 70.0,
    "weight": 85000
  },
  {
    "productName": "Siemens FreshSense Bottom Freezer Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Siemens FreshSense Bottom Freezer Refrigerator uses intelligent sensors to maintain stable temperatures. It protects food from sudden temperature changes. The bottom freezer design improves daily usability. This model is suitable for modern households.",
    "price": 2099,
    "sellingPrice": 1899,
    "width": 70.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 98000
  },
  {
    "productName": "Beko EverFresh Plus Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Beko EverFresh Plus Refrigerator extends the freshness of fruits and vegetables through precise humidity control. It maintains consistent cooling throughout the compartments. The interior is optimized for flexible storage. This refrigerator offers strong value for families.",
    "price": 1699,
    "sellingPrice": 1499,
    "width": 69.0,
    "height": 186.0,
    "length": 70.0,
    "weight": 90000
  },
  {
    "productName": "Electrolux Cooling360 French Door Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Electrolux Cooling360 French Door Refrigerator delivers even cooling across all shelves. It uses advanced airflow technology to maintain freshness. The spacious design allows organized storage for large households. This model fits premium kitchen environments.",
    "price": 2999,
    "sellingPrice": 2699,
    "width": 83.0,
    "height": 178.5,
    "length": 73.0,
    "weight": 125000
  },
  {
    "productName": "Sharp Advanced Inverter MultiDoor Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Sharp Advanced Inverter MultiDoor Refrigerator offers efficient cooling with multiple storage zones. It reduces energy consumption while maintaining consistent temperatures. The multi-door layout improves organization. This refrigerator suits busy family kitchens.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 83.0,
    "height": 181.0,
    "length": 74.0,
    "weight": 115000
  },
  {
    "productName": "Gorenje IonAir Retro Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Gorenje IonAir Retro Refrigerator combines classic design with modern cooling technology. It uses ionization to maintain a fresh interior environment. The appliance delivers reliable cooling performance. This model adds a distinctive visual style to kitchens.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 60.0,
    "height": 194.0,
    "length": 66.0,
    "weight": 88000
  },
  {
    "productName": "Liebherr Peak BioFresh Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 5.0,
    "description": "The Liebherr Peak BioFresh Refrigerator is engineered for superior food preservation. It maintains optimal humidity and temperature for fresh ingredients. The premium construction ensures durability and quiet operation. This refrigerator targets luxury kitchen installations.",
    "price": 4899,
    "sellingPrice": 4599,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 122000
  },
  {
    "productName": "LG UVnano Hygiene Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The LG UVnano Hygiene Refrigerator is designed to improve cleanliness by reducing bacteria on key touch points. It delivers consistent cooling with advanced air circulation. The interior provides flexible shelving for everyday storage. This refrigerator is suitable for families prioritizing hygiene and freshness.",
    "price": 2599,
    "sellingPrice": 2399,
    "width": 70.0,
    "height": 186.0,
    "length": 68.0,
    "weight": 98000
  },
  {
    "productName": "Samsung Power Cool Side-by-Side Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Samsung Power Cool Side-by-Side Refrigerator provides rapid cooling to quickly chill food and beverages. It maintains stable temperatures even during frequent door openings. The spacious side-by-side layout improves organization. This model fits busy household environments.",
    "price": 2099,
    "sellingPrice": 1899,
    "width": 91.0,
    "height": 178.0,
    "length": 72.0,
    "weight": 124000
  },
  {
    "productName": "Bosch HomeProfessional NoFrost Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.8,
    "description": "The Bosch HomeProfessional NoFrost Refrigerator is built for premium performance and durability. It prevents ice buildup while maintaining precise temperature control. The interior is designed for flexible and organized storage. This refrigerator is ideal for high-end kitchen installations.",
    "price": 3999,
    "sellingPrice": 3699,
    "width": 75.0,
    "height": 193.0,
    "length": 60.0,
    "weight": 118000
  },
  {
    "productName": "Whirlpool FreshControl Supreme Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Whirlpool FreshControl Supreme Refrigerator automatically adjusts cooling based on load and usage. It helps preserve food quality for longer periods. The interior layout is practical and easy to organize. This model offers reliable everyday performance.",
    "price": 1899,
    "sellingPrice": 1699,
    "width": 70.0,
    "height": 180.0,
    "length": 72.0,
    "weight": 95000
  },
  {
    "productName": "Siemens CoolEfficiency MultiDoor Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Siemens CoolEfficiency MultiDoor Refrigerator combines advanced cooling with modern design. It offers even temperature distribution across all compartments. The multi-door layout improves access and storage flexibility. This refrigerator suits premium household kitchens.",
    "price": 3599,
    "sellingPrice": 3299,
    "width": 83.0,
    "height": 183.0,
    "length": 74.0,
    "weight": 138000
  },
  {
    "productName": "Beko Active Fresh Blue Light Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Beko Active Fresh Blue Light Refrigerator uses specialized lighting to help preserve vitamins in fruits and vegetables. It maintains consistent cooling and low energy consumption. The interior is optimized for everyday storage needs. This model provides solid value for families.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 69.0,
    "height": 186.0,
    "length": 70.0,
    "weight": 88000
  },
  {
    "productName": "Electrolux CustomFlex Smart Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Electrolux CustomFlex Smart Refrigerator offers modular storage solutions for flexible organization. It delivers stable cooling and quiet operation. The smart features support modern household needs. This refrigerator integrates well into contemporary kitchens.",
    "price": 2699,
    "sellingPrice": 2499,
    "width": 70.0,
    "height": 188.0,
    "length": 68.0,
    "weight": 100000
  },
  {
    "productName": "Sharp FreshShield Quad Door Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Sharp FreshShield Quad Door Refrigerator is designed to protect food from odor mixing. It offers multiple compartments with independent cooling zones. The quad-door layout improves accessibility and organization. This refrigerator suits large families.",
    "price": 2399,
    "sellingPrice": 2199,
    "width": 83.0,
    "height": 181.0,
    "length": 74.0,
    "weight": 120000
  },
  {
    "productName": "Gorenje SmartAdapt Bottom Freezer Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Gorenje SmartAdapt Bottom Freezer Refrigerator adapts cooling based on usage habits. It reduces temperature fluctuations caused by frequent door openings. The interior layout provides flexible storage options. This model is suitable for everyday family use.",
    "price": 1499,
    "sellingPrice": 1349,
    "width": 60.0,
    "height": 185.0,
    "length": 66.0,
    "weight": 82000
  },
  {
    "productName": "Liebherr GrandCru Wine & Refrigerator Combo",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.9,
    "description": "The Liebherr GrandCru Wine & Refrigerator Combo combines food and wine storage in a single premium appliance. It maintains precise temperature zones for different storage needs. The build quality ensures quiet and reliable operation. This refrigerator is designed for luxury kitchens.",
    "price": 5299,
    "sellingPrice": 4999,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 125000
  },
  {
    "productName": "LG Multi Air Flow Top Freezer Refrigerator",
    "brandName": "LG",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The LG Multi Air Flow Top Freezer Refrigerator ensures even cooling across all shelves. It helps keep food fresh by distributing cold air efficiently. The top freezer layout is practical and easy to use. This refrigerator is suitable for small to medium households.",
    "price": 1099,
    "sellingPrice": 999,
    "width": 60.0,
    "height": 170.0,
    "length": 68.0,
    "weight": 70000
  },
  {
    "productName": "Samsung Twin Cooling Supreme Refrigerator",
    "brandName": "Samsung",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Samsung Twin Cooling Supreme Refrigerator maintains optimal humidity levels in both fridge and freezer compartments. This helps preserve food freshness and prevent odor mixing. The interior is spacious and well-organized. It is ideal for modern family kitchens.",
    "price": 2399,
    "sellingPrice": 2199,
    "width": 70.0,
    "height": 185.0,
    "length": 72.0,
    "weight": 100000
  },
  {
    "productName": "Bosch EcoSilence Drive Refrigerator",
    "brandName": "Bosch",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.7,
    "description": "The Bosch EcoSilence Drive Refrigerator is designed for quiet and energy-efficient operation. It offers consistent cooling with minimal noise. The interior layout allows flexible food storage. This refrigerator is suitable for apartments and family homes alike.",
    "price": 1999,
    "sellingPrice": 1799,
    "width": 70.0,
    "height": 186.0,
    "length": 66.0,
    "weight": 90000
  },
  {
    "productName": "Whirlpool ProFresh Inverter Refrigerator",
    "brandName": "Whirlpool",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Whirlpool ProFresh Inverter Refrigerator uses adaptive cooling technology to maintain stable temperatures. It reduces energy consumption while preserving food quality. The design focuses on durability and ease of use. This model fits well in everyday family settings.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 68.0,
    "height": 178.0,
    "length": 70.0,
    "weight": 86000
  },
  {
    "productName": "Siemens CoolSense Bottom Freezer Refrigerator",
    "brandName": "Siemens",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.6,
    "description": "The Siemens CoolSense Bottom Freezer Refrigerator maintains consistent cooling even during frequent door openings. Its intelligent sensors help protect food quality. The bottom freezer design improves accessibility. This refrigerator is suitable for contemporary kitchens.",
    "price": 2199,
    "sellingPrice": 1999,
    "width": 70.0,
    "height": 193.0,
    "length": 66.0,
    "weight": 98000
  },
  {
    "productName": "Beko FreshGuard Double Door Refrigerator",
    "brandName": "Beko",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.3,
    "description": "The Beko FreshGuard Double Door Refrigerator offers reliable cooling with efficient energy use. It features spacious compartments for organized storage. The appliance is designed for durability and daily convenience. This model is ideal for budget-conscious families.",
    "price": 1199,
    "sellingPrice": 1049,
    "width": 67.0,
    "height": 170.0,
    "length": 70.0,
    "weight": 74000
  },
  {
    "productName": "Electrolux PureAdvantage Refrigerator",
    "brandName": "Electrolux",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.5,
    "description": "The Electrolux PureAdvantage Refrigerator delivers consistent cooling with advanced filtration. It helps maintain a clean interior environment. The flexible shelving supports everyday storage needs. This refrigerator is designed for reliable household use.",
    "price": 2099,
    "sellingPrice": 1899,
    "width": 70.0,
    "height": 187.0,
    "length": 68.0,
    "weight": 94000
  },
  {
    "productName": "Sharp Gentle AirFlow Refrigerator",
    "brandName": "Sharp",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.2,
    "description": "The Sharp Gentle AirFlow Refrigerator uses controlled airflow to prevent food drying. It maintains even cooling throughout the interior. The appliance focuses on energy efficiency and reliability. This model suits small to medium households.",
    "price": 1399,
    "sellingPrice": 1249,
    "width": 68.5,
    "height": 180.0,
    "length": 70.0,
    "weight": 88000
  },
  {
    "productName": "Gorenje AdaptCool Plus Refrigerator",
    "brandName": "Gorenje",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.4,
    "description": "The Gorenje AdaptCool Plus Refrigerator adapts cooling performance based on usage patterns. It reduces temperature fluctuations for better food preservation. The interior provides flexible storage options. This refrigerator is designed for family kitchens.",
    "price": 1599,
    "sellingPrice": 1399,
    "width": 60.0,
    "height": 185.0,
    "length": 66.0,
    "weight": 83000
  },
  {
    "productName": "Liebherr Comfort BioCool Refrigerator",
    "brandName": "Liebherr",
    "productType": "refrigerator",
    "productImages": [],
    "rating": 4.8,
    "description": "The Liebherr Comfort BioCool Refrigerator provides precise temperature control for optimal food freshness. It includes humidity-controlled compartments for produce. The premium construction ensures quiet and reliable operation. This refrigerator is suitable for high-end kitchen installations.",
    "price": 3299,
    "sellingPrice": 2999,
    "width": 75.0,
    "height": 185.0,
    "length": 60.0,
    "weight": 110000
  }
]